import 'dart:convert';

import 'package:flutter/material.dart';
import 'package:flutter_chat_ui/flutter_chat_ui.dart';
import 'package:flutter_chat_types/flutter_chat_types.dart' as types;
import 'package:fluttertoast/fluttertoast.dart';
import 'package:uuid/uuid.dart';
import 'package:google_generative_ai/google_generative_ai.dart';
import 'package:http/http.dart' as http;

enum ChatType {
  simple,
  pretrain,
  pretrainAndCharacter,
  functionCallbackFinance,
  functionCallbackAPI
}

class TransferObject {
  final String receiver;
  final String owner;
  final int amount;

  TransferObject(this.receiver, this.owner, this.amount);

  factory TransferObject.fromJson(Map<String, Object?> json) => TransferObject(
      json['receiver'] as String,
      json['owner'] as String,
      json['amount'] as int);
}

class ChatPage extends StatefulWidget {
  final ChatType chatType;
  const ChatPage({super.key, required this.chatType});

  @override
  State<ChatPage> createState() => _ChatPageState();
}

class _ChatPageState extends State<ChatPage> {
  late final GenerativeModel _model;
  late final ChatSession _chat;

  final prepromptFinancial = '''
  Your task is to chat with customers who need helps about financial mobile application

  you have learned about how to split money for 6 jars theory based on the content below in quote.
  Content: "สำหรับคนที่อยากเปลี่ยนแปลงชีวิต ด้วยการกลายเป็นคนที่มีเงินแสน หรือเป็นเศรษฐีเงินล้าน บทความนี้ MAKE จะขอแนะนำเทคนิคเด็ดๆ ที่อาจช่วยให้คุณมีวิธีเก็บเงินที่เป็นระบบ และมีวินัยกว่าที่เคย

  หากคุณต้องการทำให้เงินที่มีอยู่งอกเงยขึ้น หรืออยากปรับแนวคิดการจัดการเรื่องเงิน เทคนิค “6 Jars” หรือ “ขวดโหล 6 ใบ” อาจเป็นก้าวใหม่ที่เปลี่ยนโลกการเงินของคุณ ให้ก้าวสู่ความมั่งคั่งแบบทันตา
  
  6 Jars คืออะไร มีที่มาอย่างไร
  หากคุณกำลังมองหาทริกเก็บเงิน หรือแนวคิดที่ช่วยในการบริหารจัดการเงิน ปัจจุบันมีหนึ่งในแนวคิดที่ได้รับความนิยม และเป็นที่สนใจอย่างแพร่หลาย นั่นก็คือ 6 Jars
  
  6 Jars เป็นเทคนิคของนักการเงินชื่อดัง ซึ่งจะช่วยให้คุณจัดการเงินได้อย่างมีระบบ และสร้างความมั่นคงให้กับเงินในกระเป๋า ด้วยแนวคิดที่ไม่ซับซ้อน ทำให้ 6 Jars เป็นทางเลือกที่มีประสิทธิภาพในการเตรียมแผนการเงินของคุณให้พร้อมรับมือกับอนาคต
  
  6 Jars คืออะไร
  6 Jars เป็นทฤษฎีเกี่ยวกับขวดโหล 6 ใบ เปรียบเหมือนการแบ่งเงินไว้ในขวดโหล โดยแต่ละใบก็จะมีวัตถุประสงค์ที่แตกต่างกัน เช่น เงินออม การลงทุน การชำระหนี้ และอื่นๆ
  
  เพราะฉะนั้น แนวคิด 6 Jars จึงช่วยให้คุณมีการวางแผนวิธีเก็บเงินที่ชัดเจน เห็นภาพรวมของเงินในแต่ละส่วน และยังช่วยปรับพฤติกรรมการเงิน เพื่อให้คุณสามารถใช้ชีวิตอย่างมั่นคง โดยไม่ต้องเผชิญกับความหนักใจเรื่องเงิน
  
  ผู้คิดค้นเทคนิค 6 Jars
  6 Jars เป็นเทคนิคที่พัฒนาขึ้น โดยกูรูชื่อดังแห่งแวดวงการเงินอย่าง T. Harv Eker ซึ่งเป็นทั้งวิทยากร นักพูดสร้างแรงบันดาลใจ นักเขียนด้านการเงิน และนักธุรกิจชาวแคนาดา
  
  โดยผลงานของ T. Harv Eker ที่ได้รับความนิยม นั่นคือ หนังสือถอดรหัสลับสมองเงินล้าน ซึ่งหลายคนน่าจะเคยเห็น และรู้จักกันเป็นอย่างดี
  
  เช่นเดียวกับเทคนิค 6 Jars ที่เป็นวิธีเก็บเงินที่ได้รับความนิยมกว้างขวาง และมีผู้ทำตามจำนวนมากในทั่วทุกมุมโลก
  
  วิธีเก็บเงินด้วยเทคนิค 6 Jars ขวดโหลแต่ละใบคืออะไรบ้าง?
  อ่านมาถึงตรงนี้ อาจจะเริ่มเห็นภาพแล้วว่า เทคนิค 6 Jars เป็นวิธีเก็บเงินที่ใช้โมเดลการแบ่งเงินที่คุณได้รับเข้ามา ออกเป็นขวดโหล 6 ใบ ตามชื่อของแนวคิด
  
  ซึ่งแต่ละใบก็จะมีวัตถุประสงค์ และเป้าหมายที่แตกต่างกัน เมื่อคุณเห็นภาพรวมของเงินแต่ละส่วนแล้ว ก็จะสามารถใช้ข้อมูลนี้ไปต่อยอด วางแผนการเงินที่เหมาะกับตัวเองได้ มาดูกันว่าขวดโหลแต่ละใบคืออะไรบ้าง
  
  โหลใบที่ 1 สำหรับการใช้จ่ายเงินที่จำเป็น 55%
  โหลใบแรกอย่างโหลค่าใช้จ่ายจำเป็น เป็นส่วนที่สำคัญที่สุดของ 6 Jars โดยให้สัดส่วนที่ควรจัดสรรเป็น 55% ซึ่งเงินส่วนนี้เป็นเงินที่จะใช้จ่ายกับเรื่องจำเป็นต่างๆ เช่น ค่าน้ำ ค่าไฟ ค่าอาหาร ดังนั้นขวดโหลใบนี้ต้องมีการวางแผนอย่างดี เพื่อให้ใช้จ่ายเพียงพอ และไม่ต้องเบิกเงินจากขวดโหลใบอื่น
  
  การจัดการขวดโหลใบนี้ ต้องทำควบคู่กับวิธีเก็บเงินอื่นๆ ด้วย เช่น การปรับตัว ประหยัดค่าใช้จ่ายที่ไม่จำเป็น เพื่อให้คุณยังมีเงินสำหรับเก็บออม หรือลงทุนกับขวดโหลใบอื่น
  
  โหลใบที่ 2 สำหรับให้รางวัลชีวิตกับตนเอง 10%
  โหลใบที่ 2 เป็นขวดโหลที่ 6 Jars กำหนดไว้ ว่าให้รางวัลชีวิตตัวเอง และไม่ได้มีเป้าหมายเรื่องการเงิน เพื่อให้การเก็บเงินไม่ตึงเครียดจนเกินไป โดยความสำคัญของโหลนี้คือ การสร้างความสุขและความพอใจในชีวิต เป็นโหลที่คอยเตือนอยู่เสมอ ว่าการเก็บเงินควรทำแบบค่อยเป็นค่อยไป
  
  วิธีการใช้โหลนี้ สิ่งสำคัญไม่ใช่วิธีการเก็บเงินในโหล แต่เป็นวิธีการใช้เงิน ควรใช้ในเรื่องที่คุณสนุก และชื่นชอบ เช่น การเดินทางท่องเที่ยว ค่าอาหารมื้อหรู หรือการซื้อของสะสมต่างๆ แต่อย่างไรก็ตาม ควรระมัดระวังขอบเขตการใช้จ่าย ไม่ให้เกิน 10% ของรายได้ในแต่ละเดือน
  
  โหลใบที่ 3 สำหรับการศึกษาและพัฒนาตนเอง 10%
  สำหรับโหลใบที่ 3 ของ 6 Jars เป็นขวดโหลการศึกษาและพัฒนาตนเอง นั่นคือวิธีเก็บเงินเพื่อนำไปใช้ในการต่อยอดความรู้ และเสริมสร้างทักษะ เช่น การซื้อคอร์สเรียนต่างๆ หนังสือน่าอ่าน หรือสิ่งที่เป็นประโยชน์ในการพัฒนาตัวเอง
  
  เมื่อความรู้เพิ่มขึ้น โอกาสในการหางานทำ หรือเสริมสร้างรายได้ในอนาคตก็จะเพิ่มขึ้นไปด้วย เพราะฉะนั้น ขวดโหลนี้จึงเป็นเหมือนการลงทุนในตัวเอง ทำให้คุณมีโอกาสในชีวิตที่มากขึ้น
  
  โหลใบที่ 4 สำหรับการให้ผู้อื่น 5%
  โหลใบที่ 4 ในเทคนิค 6 Jars จะเป็นโหลที่เน้นให้โอกาสกับคนอื่น โดยส่วนสำคัญของขวดโหลนี้คือ การแบ่งปันสิ่งที่ตัวเองมี ให้กับคนที่ขาดแคลน เพื่อเป็นส่วนหนึ่งในการสร้างสังคมที่น่าอยู่มากขึ้น
  
  โหลใบนี้จึงเป็นวิธีเก็บเงินที่ใช้ในการทำความดี ไม่ว่าจะเป็นการบริจาคให้มูลนิธิ ทำบุญ หรือให้ของขวัญกับคนใกล้ชิด เป็นโหลที่แสดงให้เห็นถึงความเอาใจใส่ต่อผู้อื่นและสังคม
  
  โหลใบที่ 5 สำหรับเงินเก็บสำรองแบบระยะยาว 10%
  โหลใบที่ 5 ของ 6 Jars เป็นวิธีเก็บเงินสำรองระยะยาวเพื่อความมั่นคงในชีวิต โดยการแบ่งส่วนเงินในขวดโหลนี้ ควรเป็นการเก็บออมสำหรับอนาคต ไม่ใช่การใช้จ่ายรายวัน หรือลงทุนระยะสั้น
  
  การเก็บเงินสำหรับขวดโหลใบนี้อาจทำได้หลายแบบ เช่น ฝากเงินในบัญชีฝากประจำ หรือการซื้อประกันชีวิต ซึ่งขวดใบนี้จะเป็นขวดโหลอีกใบที่จะส่วนที่ช่วยให้คุณมีความมั่นคงทางการเงินในอนาคต
  
  โหลใบที่ 6 สำหรับสร้างอิสรภาพทางการเงินให้ตนเอง 10%
  โหลใบสุดท้าย ในเทคนิค 6 Jars เป็นวิธีเก็บเงินเพื่อสร้างอิสรภาพทางการเงิน โดยส่วนที่ควรจัดสรรในโหลนี้คือ 10% ของรายได้ โดยเป้าหมายก็คือ การลงทุนที่สร้างรายได้สม่ำเสมอ หรือ Passive Income ที่คุณสามารถต่อยอดเพิ่มมูลค่าได้ในอนาคต
  
  โหลใบนี้เป็นโอกาสที่ทำให้คุณสามารถลงทุนในหุ้น กองทุน คริปโต ทองคำ หรือการซื้ออสังหาริมทรัพย์ได้ ซึ่งจะช่วยให้คุณมีรายได้ระยะยาว และเปิดโอกาสให้คุณมีอิสระทางการเงินในอนาคต
  
  แนะนำแอป MAKE by KBank ตัวช่วยแบ่งเงินชั้นเยี่ยมตามเทคนิค 6 Jars
  6jars-money-saving.jpg
  
  ถึงแม้ว่าเทคนิค 6 Jars จะเป็นสิ่งที่น่าสนใจ และมีประสิทธิภาพ แต่หาไม่เห็นการแบ่งเงินอย่างเป็นรูปธรรม ก็อาจทำให้สับสนหรือหมดกำลังใจจะออมได้ แอปเก็บเงิน MAKE by KBank จะช่วยให้การบริหารเงินกลายเป็นเรื่องที่สะดวก ง่าย และเห็นการแบ่งเงินในบัญชีอย่างชัดเจนมากขึ้นไปอีกขั้น!
  
  ถ้าคุณต้องการแยกเงินตามหลัก 6 Jars ขอแนะนำให้ลองใช้แอป MAKE by KBank ที่จะช่วยให้คุณกำหนดเป้าหมาย และแบ่งเงินแต่ละส่วนอย่างง่ายดาย สะดวกสบาย เพราะจัดการเงินได้ทุกที่ทุกเวลาผ่านสมาร์ทโฟน ซึ่งจะทำให้วิธีเก็บเงินแบบจริงจังตามแนวคิด 6 Jars ประสบความสำเร็จได้เร็วขึ้น
  
  1. Cloud Pocket
  Cloud Pocket เป็นฟีเจอร์ที่จะช่วยให้คุณแบ่งเงินเป็นสัดส่วนตามแนวคิด 6 Jars ได้อย่างง่ายดาย โดยคุณสามารถสร้างกระเป๋าขึ้นมาแทนโหลแต่ละใบ ตามจุดประสงค์ที่ต่างกัน เช่น เที่ยว ซื้อของ หรือลงทุน โดยการแยกเงินเป็นสัดส่วนจะทำให้ง่ายต่อการจัดการ
  
  ฟีเจอร์นี้จึงให้ทั้งความสะดวกและความยืดหยุ่นในการจัดการเงิน ช่วยลดข้อผิดพลาดในการใช้เงิน และยังช่วยเสริมสร้างวิธีการออมเงินให้สม่ำเสมอมากขึ้นด้วย
  
  2. Expense Summary
  Expense Summary เป็นฟีเจอร์ใน MAKE by KBank ที่มีหน้าที่สรุปยอดค่าใช้จ่ายที่ดำเนินการผ่านแอป โดยจะใช้หลักการแบ่งหมวดหมู่คล้ายกับ 6 Jars แต่เป็นการแบ่งในฝั่งรายจ่าย คือ ค่าอาหาร การเดินทาง ความบันเทิง ช้อปปิ้ง ชำระบิล และอื่นๆ
  
  นอกจากนี้ ยังช่วยให้คุณไม่ต้องมานั่งเขียนตารางรายรับรายจ่าย หรือสรุปบัญชีรายรับรายจ่ายด้วยตัวเองทุกครั้ง เดือนไหนที่ใช้เงินเกินตัวกับเรื่องอะไรมากเกินไป ก็สามารถวางแผนวิธีเก็บเงินใหม่ได้ตามต้องการ
  
  3. Pop Pay
  Pop Pay เป็นฟีเจอร์ที่ให้คุณโอนเงินระหว่างกลุ่มเพื่อนๆ ที่ใช้ MAKE by KBank ในระยะไม่เกิน 10 เมตร ได้โดยไม่ต้องใช้เลขที่บัญชี รหัสพร้อมเพย์ หรือสแกน QR Code แบบเดิมๆ
  
  ซึ่งคุณสามารถใช้ Pop Pay สำหรับใช้จ่ายในขวดโหลใบที่ 4 ตามแนวคิด 6 Jars ที่เป็นการให้รางวัลตัวเอง นอกเหนือไปจากวิธีเก็บเงินอื่นๆ ได้ อย่างการไปทานอาหารมื้อพิเศษกับเพื่อน แล้วต้องโอนเงินให้กัน เรียกได้ว่าเป็นฟีเจอร์ที่ทำให้ชีวิตง่ายขึ้นไปอีกระดับ
  
  4. Chat Banking
  ฟีเจอร์ Chat Banking เป็นเหมือนเลขาส่วนตัวในยุคดิจิทัล ที่จะทำให้คุณทำตามเทคนิค 6 Jars ได้ดีขึ้น โดยจะช่วยในการจดบันทึกธุรกรรมของคุณ รวมถึงรายละเอียดต่างๆ ในธุรกรรมดังกล่าว และยังสามารถเรียกดูรายการที่ใช้จ่ายได้แบบละเอียด ในรูปแบบแชตที่คุ้นเคย
  
  ฟีเจอร์นี้จะทำให้คุณไม่ต้องคอยเปิดหาสลิปโอนเงินในคลังรูป หรือค้นหาข้อมูลในสมุดบัญชีอีกต่อไป เพราะการทำงานของฟีเจอร์นี้จะช่วยให้คุณสามารถวางแผน และเปรียบเทียบการใช้เงินในแต่ละหมวดให้เป็นไปตามวิธีเก็บเงินที่ตั้งไว้ได้
  
  5. Money Request
  นอกจากฟีเจอร์ที่ช่วยให้คุณเก็บเงินของตนเองเทคนิค 6 Jars แล้ว แอป MAKE by KBank ยังมีฟีเจอร์ Money Request ความสามารถใหม่ล่าสุดที่พัฒนาขึ้นมา เพื่อช่วยให้คุณสามารถเก็บเงินจากเพื่อนๆ ได้ด้วย
  
  โดยเฉพาะกับคนที่กำลังคิดวิธีเก็บเงินจากเพื่อน ไม่กล้าทวงเงิน เพียงคุณส่งรายการเรียกเก็บหรือ Money Request ไปยังเพื่อนคนนั้น MAKE ก็จะแจ้งเตือนไปทันที ทำให้คุณไม่ต้องกังวลเลยว่าจะผิดใจในการเรียกเก็บเงินกับเพื่อนๆ
  
  สรุปวิธีเก็บเงิน 6 Jars
  วิธีเก็บเงินให้อยู่ด้วยเทคนิค 6 Jars เป็นทางเลือกในการจัดการเงินของคุณให้มีระบบระเบียบ เพิ่มโอกาสในการเติมเต็มเป้าหมายของวิธีออมเงินที่ตั้งไว้ ด้วยการแบ่งเงินเป็นหมวดหมู่ที่แตกต่างกัน
  
  และเพื่อเพิ่มประสิทธิภาพในการทำตามเทคนิค 6 Jars แอป MAKE by KBank จึงเป็นเครื่องมือที่จะเป็นตัวช่วยให้คุณเก็บเงินได้ง่ายขึ้นจากฟีเจอร์ต่างๆ ที่ช่วยอำนวยความสะดวก ช่วยให้คุณติดตามความคืบหน้า และตรวจสอบรายละเอียดของการเก็บเงินได้ตลอดเวลา"

  For based knowledge that you need to answer the question, you can find it as 
  JSON below. while key "question" will be the question, and key "answer" will be an answer. and please
  use the exact answer to answer customer question. You can add extra catchword, or your characteristic but not allow to change
  any content inside the answer.

  JSON:
  [
    {
       "question":"สมัครใช้งานอย่างไร / เปิดบัญชี MAKE by KBank อย่างไร ?",
       "answer":"ลูกค้าสามารถเปิดบัญชีได้ด้วยตัวเอง ง่ายๆ เพียงดาวน์โหลดแอป MAKE by KBank จาก App Store หรือ Google Play Store และเปิดบัญชีผ่านแอปได้ทันที โดยยืนยันตัวตนผ่าน K PLUS หรือสมัครโดยการกรอกข้อมูลบัตรประชาชน"
    },
    {
       "question":"สมัคร MAKE by KBank ผ่าน WiFi ได้หรือไม่ ?",
       "answer":"ไม่สามารถทำได้ ในขั้นตอนการสมัครจำเป็นต้องใช้สัญญาณอินเทอร์เนต 3G/4G/5G จาก SIM ในเครื่องเท่านั้น"
    },
    {
       "question":"บัญชี MAKE by KBank เชื่อมต่อกับบัญชีในแอป K PLUS หรือไม่ ?",
       "answer":"MAKE by KBank คือ บัญชี K-eSavings ที่ไม่เชื่อมต่อกับแอป K PLUS และบัญชีอื่นของธนาคารกสิกรไทย หากต้องการใช้งาน ลูกค้าจะต้องเปิดบัญชีใหม่ผ่านแอป MAKE by KBank เท่านั้น"
    },
    {
       "question":"ไม่มีบัญชีธนาคารกสิกรไทยใช้ MAKE by KBank ได้หรือไม่ ?",
       "answer":"สามารถใช้งานได้ โดยเลือกการสมัครแบบกรอกข้อมูลบัตรประชาชน และนำบัตรประชาชนไปยืนยันตัวตนที่ตู้ ATM ธนาคารกสิกรไทย ที่มีสัญลักษณ์ K CHECK ID, ที่สาขาธนาคาร หรือ ร้านค้าพันธมิตรใกล้บ้านคุณ เช่น Big C  ไปรษณีย์ไทย"
    },
    {
       "question":"MAKE by KBank มีค่าธรรมเนียมแรกเข้าหรือขั้นต่ำในการเปิดบัญชี หรือไม่ ?",
       "answer":"MAKE by KBank สมัครฟรี ไม่มีค่าธรรมเนียมแรกเข้า และไม่มีขั้นต่ำในการเปิดบัญชี"
    },
    {
       "question":"ไม่ใช่สัญชาติไทย สมัคร MAKE by KBank ได้หรือไม่ ?",
       "answer":"ปัจจุบัน MAKE by KBank ให้บริการได้เฉพาะผู้ที่มีสัญชาติไทยเท่านั้น"
    },
    {
       "question":"เปิดบัญชี MAKE by KBank ในนามบริษัทได้หรือไม่",
       "answer":"ไม่สามารถเปิดบัญชี MAKE by KBank ในนามบริษัทได้"
    },
    {
       "question":"เปลี่ยนวิธียืนยันตัวตนอย่างไร ?",
       "answer":"กรณีต้องการเปลี่ยนวิธียืนยันตัวตน ทำได้โดยการลบแอป แล้วโหลดใหม่"
    },
    {
       "question":"ยืนยันตัวตนต้องทำอย่างไร ?",
       "answer":"การยืนยันตัวตนสามารถทำได้ 2 วิธี (ฟรี)ยืนยันตัวตนผ่านแอป K PLUSการนำบัตรประชาชนไปยืนยันตัวตนที่ตู้ ATM ธนาคารกสิกรไทย ที่มีสัญลักษณ์ K CHECK ID, ที่สาขาธนาคาร หรือ ร้านค้าพันธมิตรใกล้บ้านคุณ เช่น Big C  ไปรษณีย์ไทยตรวจสอบจุดบริการยืนยันตัวตน คลิกเพื่อดูจุดยืนยันตัวตน"
    },
    {
       "question":"ยืนยันใบหน้าไม่ได้ สเเกนใบหน้าเกินจำนวนครั้งต้องทำอย่างไร ?",
       "answer":"ลูกค้าจะต้องหาพื้นหลังเรียบๆ แสงสีขาวและทำการสแกนใหม่อีกครั้ง หมายเหตุ : หากภาพใบหน้าไม่เหมือนในบัตรประชาชนอาจทำให้สแกนไม่ผ่าน"
    },
    {
       "question":"สามารถสร้าง Cloud Pocket ได้สูงสุดเท่าไหร่ ?",
       "answer":"ไม่จำกัดจำนวน"
    },
    {
       "question":"เก็บเงินเกินเป้าหมายที่ตั้งไว้ใน Cloud Pocket ได้หรือไม่ ?",
       "answer":"สามารถเก็บเงินเกินเป้าหมายที่ตั้งไว้ได้"
    },
    {
       "question":"แถบโอนเงินเข้าออกใน Cloud Pocket หายไป แก้ไขอย่างไร ?",
       "answer":"เลื่อนขึ้นไปด้านบนสุดของแชทและเลื่อนลงมาล่างสุด เพื่อทำการ Refresh หน้าจอ"
    },
    {
       "question":"เจ้าของ Cloud Pocket สามารถทำอะไรได้บ้าง ?",
       "answer":"เจ้าของ Shared Cloud Pocket คือ คนที่สร้าง Shared Cloud Pocket นั้น จะมีสิทธิ์ ดังนี้สิทธิ์ในการจัดการสมาชิก ชวนเพื่อนเข้าหรือเชิญออกจาก Shared Cloud Pocket สิทธิ์ในการโอนเงินออกจาก Shared Cloud Pocketทั้งนี้ สมาชิกภายใน Shared Cloud Pocket จะได้รับการแจ้งเตือนและเห็นรายการธุรกรรมที่เกิดขึ้นใน Shared Cloud Pocket นั้นได้"
    },
    {
       "question":"วิธีปลดล็อก Cloud Pocket",
       "answer":"วิธีปลดล็อก Cloud Pocket เลือก Cloud Pocket ที่ต้องการปลดล็อคกดปุ่ม “...” ที่มุมขวาบน เลือก “ตั้งค่า&ampquot; (Settings)เลือก &ampquot;แก้ไข Cloud Pocket&ampquot; และกดปลดล็อค Cloud Pocket"
    },
    {
       "question":"วิธีจัดเรียง Cloud Pocket",
       "answer":"วิธีจัดเรียง Cloud Pocketกดที่เมนูจุด 4 จุดมุมขวาบน ในหน้า Cloud Pocket เพื่อเปิดเมนูเพิ่มเติมเลือก &ampquot;จัดลำดับ&ampquot;ย้ายตำแหน่ง Cloud Pocket ตามที่ต้องการและกดบันทึก"
    },
    {
       "question":"วิธีลบ Cloud Pocket",
       "answer":"วิธีลบ Cloud Pocketเลือก Cloud Pocket ที่ต้องการลบ กดปุ่ม “...” ที่มุมขวาบนเลือก “ตั้งค่า&ampquot; (Settings) และกดลบ Cloud Pocket นี้"
    },
    {
       "question":"ลบประวัติ Cloud Pocket ได้หรือไม่ ?",
       "answer":"ไม่สามารถลบได้"
    },
    {
       "question":"วิธีเพิ่มเพื่อนใน Cloud Pocket",
       "answer":"วิธีเพิ่มเพื่อนใน Cloud Pocketเลือก Cloud Pocket ที่ต้องการเพิ่มเพื่อนกดปุ่ม “...” ที่มุมขวาบนเลือก “สมาชิก&ampquot; (Member) แล้วเพิ่มเพื่อนที่ต้องการจัดการเงินร่วมกัน"
    },
    {
       "question":"จำนวนเพื่อนที่สามารถเข้าร่วม Shared Cloud Pocket ได้สูงสุดกี่คน ?",
       "answer":"ไม่จำกัดจำนวน"
    },
    {
       "question":"สมาชิกใน Shared Cloud Pocket สามารถโอนเงินออกได้หรือไม่ ?",
       "answer":"สมาชิกใน Shared Cloud Pocket ไม่สามารถโอนเงินออกได้ ทำได้เพียงโอนเงินเข้าและเห็นการทำธุรกรรมของ Shared Cloud Pocket เท่านั้น"
    },
    {
       "question":"ทุกคนที่เป็นสมาชิกใน Shared Cloud Pocket จะได้รับดอกเบี้ยหรือไม่ ?",
       "answer":"ดอกเบี้ยจะจ่ายให้กับเจ้าของบัญชีที่สร้าง Shared Cloud Pocket เท่านั้น"
    },
    {
        "question":"วิธีกรอกรหัสแนะนำย้อนหลัง / MAKE by KBank ใส่รหัสแนะนำย้อนหลังได้ไหม​",
        "answer":"วิธีการกรอกรหัสแนะนำย้อนหลังกดปุ่ม “...” ตั้งค่า ที่มุมขวาบน ในหน้า Homeจะเห็นแถบให้กรอกรหัสแนะนำย้อนหลัง โดยลูกค้าสามารถกรอกรหัสแนะนำย้อนหลังได้ถึงเที่ยงคืนของวันที่ได้รับเลขบัญชี หากเกินระยะเวลาดังกล่าวแล้วจะไม่สามารถกรอกย้อนหลังได้ ลูกค้าจะสามารถกรอกรหัสแนะนำได้เพียง 1 ครั้งเท่านั้น"
    },
    {
       "question":"วิธีการดูรหัสแนะนำของตัวเอง",
       "answer":"วิธีการดูรหัสแนะนำของตัวเองกดปุ่ม &ampquot;ชวนเพื่อน&ampquot; (รูปจรวด) ที่มุมขวาบน ในหน้า Home จะเห็นรหัสแนะนำเพื่อนของคุณ สามารถแชร์รหัสแนะนำให้เพื่อน โดยการกดปุ่ม &ampquot;ชวนเพื่อนใช้&ampquot; และเลือกปลายทางที่ต้องการแชร์ไป"
    },
    {
       "question":"วิธีตรวจสอบประวัติการเชิญเพื่อน",
       "answer":"สามารถดูได้ผ่านทางแอป MAKE by KBank โดยกดปุ่ม &ampquot;ชวนเพื่อน&ampquot; (รูปจรวด) ที่มุมขวาบน ในหน้า Home กด &ampquot;ดูประวัติ&ampquot; ที่มุมขวาบน และกดเลือกเดือนที่ต้องการตรวจสอบ"
    },
    {
       "question":"โบนัสจากเเคมเปญได้วันไหน และใน Statement จะขึ้นว่าเป็นรายการอะไร ?",
       "answer":"ขึ้นอยู่กับเงื่อนไขของแต่ละแคมเปญ สามารถดูเงื่อนไขได้จากช่องทางที่ได้รับแคมเปญ เช่น เว็บไซต์ MAKE by KBank ในหน้าโปรโมชัน หรือ Facebook MAKE by KBank หรือ แอป MAKE by KBank ในหน้า Notification ข่าวสาร MAKE ใน Statement จะขึ้นว่าเป็นรายการ &ampquot;คืนเงินตามแคมเปญ หรือ Campaign Cashback หรือ หน่วยหักปรับปรุงบัญชี/หักชำระ/ค่าธรรมเนียม"
    },
    {
       "question":"สลิปที่ทำธุรกรรมผ่านแอป MAKE by KBank ไม่บันทึกลงเครื่อง ทำอย่างไร ?",
       "answer":"ลูกค้าสามารถกดบันทึกสลิปได้ด้วยตัวเองเมื่อต้องการ และสามารถย้อนกลับมาบันทึกสลิปได้เองทุกเมื่อผ่านแอป MAKE by KBank"
    },
    {
       "question":"วิธีการ Reset PIN",
       "answer":"ลูกค้าสามารถ Reset Pin โดยกดลืมรหัสผ่านและเลือกวิธียืนยันตัวตนที่สะดวก มี 2 วิธี ดังนี้ยืนยันตัวตนผ่านแอป K PLUSยืนยันตัวตนด้วยใบหน้า ซึ่งหากข้อมูลถูกต้อง ลูกค้าจะสามารถตั้งรหัสผ่านใหม่ได้ด้วยตัวเองทันที"
    },
    {
       "question":"ใส่รหัสผ่านผิดแล้วแอปล็อค / ระบุ PIN ผิดเกินจำนวนครั้งที่ธนาคารกำหนด / บัญชี MAKE by KBank ล็อค ต้องการปลดล็อคทำได้อย่างไร?​",
       "answer":"สามารถปลดล็อคผ่าน K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801"
    },
    {
       "question":"ขึ้นให้อัปเดตแอปพลิเคชัน แต่อัปเดตไม่ได้ แก้ไขอย่างไร ?",
       "answer":"สลับสัญญาณอินเตอร์เน็ตที่ใช้อยู่ หากใช้สัญญาณ WiFi ให้เปลี่ยนเป็นสัญญาณอินเทอร์เน็ต 3G/4G/5G  และเข้าแอปใหม่อีกครั้ง"
    },
    {
       "question":"สแกน QR Code ชำระบิลไม่ได้ ทำอย่างไร ?",
       "answer":"ปัจจุบัน MAKE by KBank ยังไม่สามารถสแกนจ่ายบิลได้ อยู่ระหว่างการพัฒนา แต่สามารถสแกนจ่าย Thai QR Payment ได้"
    },
    {
       "question":"MAKE by KBank โอนเงินแล้วเงินไม่เข้าปลายทาง ทำอย่างไร ?​",
       "answer":"หากมีการโอนเงินออกจากบัญชี MAKE by KBank สำเร็จแล้ว แต่บัญชีปลายทางแจ้งว่า ยังไม่ได้รับยอดเงิน กรุณาติดต่อกรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801 เพื่อตรวจสอบข้อมูลเพิ่มเติม​"
    },
    {
       "question":"โอนเงินจากบัญชีธนาคารอื่น แล้วเงินไม่เข้าบัญชี MAKE by KBank ทำอย่างไร ?​",
       "answer":"หากมีการโอนเงินจากบัญชีอื่นสำเร็จแล้ว แต่ยอดเงินยังไม่เข้า บัญชี MAKE by KBank กรุณาติดต่อกรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801 เพื่อตรวจสอบข้อมูลเพิ่มเติม​"
    },
    {
       "question":"โอนเงินผิดบัญชี ทำอย่างไร ?",
       "answer":"หากโอนเงินผิดบัญชี กรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801 เพื่อตรวจสอบข้อมูลเพิ่มเติม"
    },
    {
       "question":"หากโดนโกงเงินต้องการอายัดบัญชี ทำอย่างไร ?",
       "answer":"เพื่อความรวดเร็วในการช่วยเหลือ กรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801"
    },
    {
       "question":"สามารถทำธุรกรรมขณะใช้ WiFi ได้หรือไม่ ?",
       "answer":"สามารถทำได้"
    },
    {
       "question":"การโอน ผ่าน MAKE by KBank มีการจำกัดวงเงินสูงสุดไว้ที่เท่าไร ?",
       "answer":"วงเงินโอนออกและสแกน QR รวม 2,000,000 บาทต่อวัน (การย้ายเงินระหว่าง Cloud Pocket ของตนเองจะไม่จำกัดวงเงินรวมต่อวัน)"
    },
    {
       "question":"สามารถปรับวงเงินการโอนได้หรือไม่ ?",
       "answer":"ไม่สามารถปรับวงเงินการโอนได้ ในปัจจุบัน MAKE by KBank มีการจำกัดวงเงินการโอนอยู่ที่ 2,000,000 บาทต่อวัน"
    },
    {
       "question":"วงเงินทำรายการต่อวันครอบคลุมธุรกรรมใดบ้าง ?",
       "answer":"วงเงินทำรายการต่อวันบน MAKE by KBank  ครอบคลุมการโอนเงินระหว่างบัญชีภายในธนาคารกสิกรไทย และการโอนเงินระหว่างธนาคาร (วงเงินนี้ไม่รวมการถอนเงินไม่ใช้บัตร)"
    },
    {
       "question":"ใช้บัญชี MAKE by KBank เป็นบัญชีรับเงินเดือนได้หรือไม่ ?",
       "answer":"สามารถใช้บัญชี MAKE by KBank ในการรับเงินเดือนได้ โดยบันทึกสมุดบัญชี Electronics ในเมนูตั้งค่า (Settings) แล้วแจ้งเลขที่บัญชีแก่ฝ่ายบุคคลของบริษัท หมายเหตุ: บัญชีของ MAKE by KBank ถือเป็นบัญชีออมทรัพย์อิเล็กทรอนิกส์ธนาคารกสิกรไทย"
    },
    {
       "question":"Swift Code ของ MAKE by KBank",
       "answer":"KASITHBK"
    },
    {
       "question":"โอนเงินล่วงหน้า (Schedule Transfer) คืออะไร ?",
       "answer":"Schedule Transfer คือฟีเจอร์ตั้งโอนเงินล่วงหน้า ช่วยให้การจัดการเงินเป็นระบบมากขึ้น โดยสามารถโอนไปยัง Cloud Pocket ปลายทางได้หลาย Cloud Pocket ภายในครั้งเดียวและสามารถกำหนดวันที่ทำรายการล่วงหน้าได้"
    },
    {
       "question":"เมนูโอนเงินล่วงหน้า (Schedule Transfer) อยู่ตรงไหน ?",
       "answer":"ลูกค้าจะต้องอัปเดตแอปให้เป็นเวอร์ชั่นล่าสุด เปิดแอป MAKE by KBankเลือกเมนู Bankingเลือกตั้งโอนล่วงหน้า (Schedule Transfer)"
    },
    {
       "question":"โอนเงินล่วงหน้า (Schedule Transfer) ระบบจะตัดยอดกี่โมง ?",
       "answer":"ระบบจะมีการทำรายการโอนล่วงหน้าที่ลูกค้าตั้งไว้ ในช่วงเวลา 23.45 – 06.45 น. ทำให้ลูกค้าไม่สามารถตั้งรายการใหม่หรือแก้ไขรายการในช่วงเวลาดังกล่าวไดทั้งนี้ ลูกค้าจะสามารถทำรายการช่วงก่อนและหลังช่วงเวลาดังกล่าวได้ตามปกติ"
    },
    {
       "question":"ฝากเงินต่างสาขามีค่าธรรมเนียมหรือไม่ อย่างไร ?",
       "answer":"กรณีฝากเงินต่างสาขาบัญชีจะมีค่าธรรมเนียมในการฝาก ข้ามเขตสำนักหักบัญชี คิดค่าบริการ 10 บาท / 10,000 บาท (ขั้นต่ำ 10 บาท / รายการ) กรณีฝากเงินเข้าบัญชีธนาคารอื่นไม่เกิน 10,000 บาท ค่าธรรมเนียม 50 บาท / รายการ"
    },
    {
       "question":"การย้ายเงิน/โอนเงิน กรณีใดบ้างที่นับรวมส่งสรรพากร ?",
       "answer":"กรณีที่ไม่นับรวมส่งสรรพากรการย้ายเงินใน Cloud Pocket ของตนเองกรณีที่นับรวมส่งสรรพากรการย้ายเงินของตนเองไปยัง Shared Cloud Pocket ของผู้อื่นที่เราเป็นสมาชิกใน Shared Cloud Pocket นั้น จะถูกนับเป็นการโอนเงินเข้าบัญชีการโอนเงินจากบัญชีอื่นมายังบัญชี MAKE by KBank"
    },
    {
       "question":"ถอนเงินไม่ใช้บัตร มีค่าธรรมเนียมหรือไม่ ?",
       "answer":"ถอนเงินไม่ใช้บัตร ฟรี ไม่มีค่าธรรมเนียม"
    },
    {
       "question":"ถอนเงินไม่ใช้บัตรได้ที่ไหน ?",
       "answer":"ลูกค้าสามารถถอนเงินไม่ใช้บัตร ได้ที่ตู้ ATM ธนาคารกสิกรไทย ทุกตู้"
    },
    {
       "question":"วิธีถอนเงินไม่ใช้บัตร",
       "answer":"วิธีถอนเงินไม่ใช้บัตรเข้าที่แอป MAKE by KBankกดเมนู &ampquot;Banking. และเลือก &ampquot;ถอนเงิน&ampquot;ใส่จำนวนเงินที่ต้องการ และกด &ampquot;ต่อไป&ampquot;สแกน QR Code ที่หน้าตู้ ATM ธนาคารกสิกรไทยหมายเหตุ: ถอนได้ไม่เกิน 50,000 บาทต่อวัน และจำนวนธนบัตรไม่เกิน 30 ใบต่อครั้ง ทั้งนี้ ไม่รวมวงเงินทำรายการผ่าน MAKE by KBank ลูกค้าจะเสียค่าธรรมเนียมเมื่อทำรายการ ณ คนละจังหวัดกับสาขาของบัญชี"
    },
    {
       "question":"สามารถถอนเงินไม่ใช้บัตรสูงสุดเท่าไรต่อวัน ?",
       "answer":"สามารถถอนเงินไม่ใช้บัตรสูงสุด 50,000 บาทต่อวัน"
    },
    {
       "question":"ตั้งแจ้งเตือนเงินเข้า-ออกบัญชีผ่านไลน์ได้หรือไม่ ?",
       "answer":"สามารถทำได้ ผ่านการแอดไลน์ KBank Live มีขั้นตอนดังนี้แอดไลน์ @KBankLiveเลือกบัญชีเงินฝากเลือกบุคคลธรรมดาเลือกบริการแจ้งเตือนเงินเข้า-ออกกดสมัครบริการ"
    },
    {
       "question":"ปิดการแจ้งเตือน Login แอปในอีเมล ทำอย่างไร ?",
       "answer":"ลูกค้าสามารถปิดการแจ้งเตือนได้ด้วยตัวเอง โดยเลือกเมนู &ampquot;ตั้งค่า&ampquot; (Settings) กดที่ &ampquot;การแจ้งเตือนเข้าใช้งาน&ampquot; (ปรับให้เป็นสีเทา)"
    },
    {
       "question":"MAKE by KBank แตกต่างจาก K PLUS อย่างไร ?",
       "answer":"MAKE by KBank เป็น Mobile Banking จากธนาคารกสิกรไทย มีจุดเด่นในเรื่องการเป็นตัวช่วยจัดการเงิน เปิดเพียงหนึ่งบัญชี แต่สามารถแยกได้หลายกระเป๋า กับฟีเจอร์หลัก &ampquot;Cloud Pocket&ampquot; ที่สร้างได้ไม่จำกัด จะช่วยให้คุณแบ่งเงินในบัญชีเป็นกระเป๋าย่อย ๆ ตามเป้าหมาย เช่น กระเป๋าเงินเก็บ กระเป๋าค่าใช้จ่าย กระเป๋าเที่ยว และอื่น ๆ"
    },
    {
       "question":"บริการของ MAKE by KBank มีความปลอดภัยหรือไม่ ?",
       "answer":"บริการ MAKE by KBank เป็นบริการที่มีความปลอดภัยสูง โดยมีมาตรการรักษาความปลอดภัยซึ่งเป็นไปตามมาตรฐานสากล และกฏระเบียบของธนาคารแห่งประเทศไทย อย่างไรก็ดีเพื่อรักษาความลับข้อมูลส่วนบุคคล เช่น เก็บรักษา PIN เป็นความลับ การตรวจสอบข้อมูลบัญชีอยู่เสมอ จะช่วยให้การใช้งาน MAKE by KBank มีประสิทธิภาพและปลอดภัยยิ่งขึ้น"
    },
    {
       "question":"บัญชี MAKE by KBank มีค่าบริการรายเดือน หรือค่าธรรมเนียมรายปีหรือไม่ ?",
       "answer":"MAKE by KBank ไม่มีค่าบริการรายเดือน และไม่มีค่าธรรมเนียมรายปี หมายเหตุ : หากบัญชีไม่มีการเคลื่อนไหวเกิน 1 ปีขึ้นไป และมีเงินในบัญชีต่ำกว่า 2,000 บาท ทางธนาคารจะคิดค่ารักษาบัญชี 50 บาทต่อเดือน"
    },
    {
       "question":"ดอกเบี้ยเงินฝากที่ได้จาก MAKE by KBank ต้องเสียภาษีหรือไม่ ?",
       "answer":"ต้องเสียภาษี กรณีดอกเบี้ยรับเกิน 20,000 บาทต่อปี จะหักภาษี ณ ที่จ่าย ร้อยละ15 ตามหลักเกณฑ์ที่กรมสรรพากรกำหนด"
    },
    {
       "question":"อัตราดอกเบี้ยเงินฝากและระยะเวลาการจ่ายดอกเบี้ย",
       "answer":"อัตราดอกเบี้ยขั้นบันไดตามยอดเงินฝาก คิดแบบอัตราก้าวหน้า รายละเอียดดังนี้วงเงิน ไม่เกิน 300,000 บาท : 1.50%วงเงิน ส่วนที่เกิน 300,000 บาท ขึ้นไป : 0.65%(อัตราดอกเบี้ยอาจมีการเปลี่ยนแปลง ดูข้อมูลล่าสุดได้ที่ www.kasikornbank.com)ระยะเวลาการจ่ายดอกเบี้ย : จ่าย 2 ครั้งต่อปี เดือนมิถุนายนและเดือนธันวาคม"
    },
    {
       "question":"แอป MAKE by KBank ใช้กับอุปกรณ์ใดได้บ้าง ?",
       "answer":"MAKE by KBank สามารถใช้งานได้กับโทรศัพท์มือถือที่ใช้ระบบปฏิบัติการ iOS 11 หรือ Android 8.0 ขึ้นไปเพื่อการใช้งานแอปอย่างมีประสิทธิภาพและเพื่อความปลอดภัยสูงสุด อย่าลืมอัพเดตระบบปฏิบัติการเป็นเวอร์ชั่นล่าสุดเสมอ"
    },
    {
       "question":"ใช้งานแอป MAKE by KBank ได้กี่เครื่องต่อคน ?",
       "answer":"เพื่อความปลอดภัยในการใช้งานแอป MAKE by KBank สามารถใช้ได้ 1 คน ต่อ 1 เครื่องโทรศัพท์มือถือ และต่อ 1 เบอร์โทรศัพท์มือถือเท่านั้น"
    },
    {
       "question":"ผูกบัญชี MAKE by KBank กับ พร้อมเพย์ (PromptPay) ได้หรือไม่ ?",
       "answer":"ปัจจุบันยังไม่สามารถทำได้ อยู่ระหว่างการพัฒนา"
    },
    {
       "question":"อยู่ต่างประเทศใช้เเอป MAKE by KBank ได้หรือไม่ ?",
       "answer":"หากไปต่างประเทศจะสามารถใช้แอปได้ แต่ห้ามทำการลบแอปขณะอยู่ที่ต่างประเทศ"
    },
    {
       "question":"ฟีเจอร์ใดบ้างที่ใช้ได้เฉพาะผู้มีบัญชี MAKE by KBank ?",
       "answer":"Cloud Pocket, Pop Pay, Friend Chat"
    },
    {
       "question":"เปิดการตั้งค่า Biometric (Face Scan) อย่างไร ?",
       "answer":"อัปเดตแอปให้เป็นเวอร์ชั่นล่าสุด หลังจากนั้นเปิดการเข้าถึงการสแกนหน้า/สแกนนิ้วในการตั้งค่าเครื่องโทรศัพท์"
    },
    {
       "question":"ในหน้า Home มีสีไม่เหมือนกันเกิดจากสาเหตุใด ?",
       "answer":"สีในหน้า Home จะแสดงตามหมวดหมู่ (Category) ที่มีการใช้จ่ายสูงสุด แบ่งเป็น 6 สี ดังนี้สีส้ม : หมวดอาหารสีชมพู : หมวดชอปปิ้งสีเขียวเข้ม : หมวดการเดินทางสีม่วง : หมวดบันเทิงสีเขียวอ่อน : หมวดชำระบิลสีฟ้า : หมวดอื่นๆ"
    },
    {
       "question":"สามารถปรับแต่งหน้าหลักของ MAKE by KBank เองได้หรือไม่ ?",
       "answer":"สีของหน้าหลักจะเปลี่ยนตามสัดส่วนการเลือกหมวดหมู่การใช้จ่าย ที่ลูกค้าเลือกขณะทำรายการโอนเงิน"
    },
    {
       "question":"การปิดบัญชี / ยกเลิก MAKE by KBank ทำอย่างไร?",
       "answer":"การปิดบัญชี หรือลบบัญชี MAKE by KBank สามารถทำได้ผ่านแอป MAKE by KBank ด้วยตัวเอง โดยเข้าไปที่ตั้งค่า (Setting) และเลือกปิดบัญชี"
    },
    {
       "question":"My Communty, My Friends คืออะไร ?",
       "answer":"My Friends คือ รายการบัญชีเพื่อนที่เกิดจากการเพิ่มด้วยตัวเอง และ รายการบัญชีเพื่อนที่เกิดจากการทำการโอนเงินสำเร็จกรณีเป็นผู้โอนอย่างเดียวเท่านั้นMy Community คือ My Friends และ รวมถึงคนที่เราเคยทำธุรกรรมด้วย แต่ยังไม่เพิ่มเป็นเพื่อนซึ่งหากเป็น My Friends แล้วจะสามารถชวนเข้ากลุ่ม Cloud Pocket ได้ถ้าเพื่อนคนนั้นเป็นผู้ใช้ MAKE เหมือนกัน"
    },
    {
       "question":"วิธีเพิ่มเพื่อน / เพิ่มสมาชิก ใน My Community และการตั้งรายการโปรด ทำอย่างไร?​",
       "answer":"ลูกค้าแอป MAKE by KBank เพิ่มสมาชิกได้ด้วยตัวเอง​ การเพิ่มเพื่อนใน My Community สามารถเพิ่มได้ 2 วิธีเพิ่มเพื่อนด้วยตัวเอง โดยกดจากเมนู My Community &ampgt;&ampgt; กด Add Friend &ampgt;&ampgt; เพิ่มบัญชีเพื่อนจากเลขที่บัญชี รหัสพร้อมเพย์ เบอร์โทรศัพท์ หรือ รายชื่อเพิ่มเพื่อนอัตโนมัติ หลังทำรายการโอนเงินสำเร็จการตั้งรายการโปรดหลังจากเพิ่มเพื่อนสำเร็จ ลูกค้าสามารถกดรูปดาว (มุมขวาบนของแชทเพื่อน) เพื่อตั้งเป็นรายการโปรด"
    },
    {
       "question":"วิธีลบเพื่อน",
       "answer":"กดเข้าไปที่เพื่อนกด &ampquot;…&ampquot; ที่มุมขวาบนตั้งค่าเพื่อนและกดซ่อน"
    },
    {
       "question":"วิธีการขอรายการเคลื่อนไหวบัญชี (Statement)",
       "answer":"ลูกค้าสามารถขอรายการเคลื่อนไหวบัญชี (Statement) ได้ด้วยตัวเอง ผ่านแอป MAKE by Kbank โดยเลือกเมนู Notificationเลือก ประวัติ / Statementกดขอ Statement โดยเลือกรายละเอียดตามที่ต้องการ"
    },
    {
       "question":"MAKE by KBank มีการส่ง Statement รายได้ ให้อัตโนมัติหรือไม่ ?",
       "answer":"ปัจจุบันยังไม่สามารถทำได้"
    },
    {
       "question":"การย้ายเงินระหว่าง Cloud Pocket ใน Statement จะแสดงรายการว่าอย่างไร ?",
       "answer":"ใน Statement จะไม่แสดงรายการการย้ายเงินระหว่าง Cloud Pocket ของตัวเอง"
    },
    {
       "question":"ขอ Bank Certificate ได้หรือไม่ อย่างไร ?",
       "answer":"สามารถขอได้ กรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801"
    },
    {
       "question":"แจ้งเปลี่ยนแปลงชื่อ-นามสกุล ของบัญชี MAKE by KBank ทำอย่างไร?​",
       "answer":"กรณีต้องการเปลี่ยนชื่อ-นามสกุลของบัญชี เจ้าของบัญชีจะต้องเป็นผู้ดำเนินการติดต่อสาขาธนาคารกสิกรไทยด้วยตนเองสิ่งที่ต้องเตรียม มีดังนี้บัตรประจำตัวประชาชนหรือบัตรอื่นที่มีรูปถ่ายที่ทางราชการออกให้ (ที่เปลี่ยนแปลงข้อมูลแล้ว)เอกสารเปลี่ยนชื่อ-นามสกุล/คำนำหน้าชื่อเครื่องโทรศัพท์ที่เข้าใช้บริการ MAKE by KBank"
    },
    {
       "question":"ดำเนินการแจ้งเปลี่ยนชื่อที่ธนาคารแล้วแต่ชื่อบัญชีในแอปยังไม่ถูกเปลี่ยน ทำอย่างไร ?",
       "answer":"หลังจากแจ้งเปลี่ยนชื่อที่ธนาคารเรียบร้อยแล้ว แนะนำให้ออกจากระบบแอป MAKE by KBank และเข้าใหม่ หรือทำธุรกรรมผ่านแอปเพื่อเป็นการตรวจสอบชื่อบัญชีอีกครั้ง"
    },
    {
       "question":"เปลี่ยนอีเมล ทำอย่างไร ?",
       "answer":"ลูกค้าสามารถเปลี่ยนอีเมลได้ด้วยตัวเอง โดยเข้าที่แอป MAKE by KBankกด &ampquot;ตั้งค่า&ampquot; (Settings) ที่มุมขวาบนเลือก &ampquot;แก้ไขอีเมลสำหรับการแจ้งเตือน ติดต่อ&ampquot;กรอกอีเมลใหม่ และกดยืนยัน"
    },
    {
       "question":"แจ้งเปลี่ยนแปลงเบอร์โทรศัพท์ใหม่ที่ผูกกับบัญชี MAKE by KBank ทำอย่างไร ?​",
       "answer":"หลังจากใส่ SIM ใหม่ในโทรศัพท์ ระบบจะทราบทันทีว่ามีการเปลี่ยนเบอร์และนำเข้าสู่ขั้นตอนการเปลี่ยนเบอร์ ให้ลูกค้าใส่หมายเลขบัตรประชาชน จากนั้นเลือกวิธียืนยันตัวตนด้วยการ Authen with K PLUS หรือการยืนยันตัวตนแบบอื่น หากข้อมูลถูกต้อง ลูกค้าจะสามารถใช้งานได้ทันที"
    },
    {
       "question":"ต้องการเข้าใช้งาน MAKE by KBank แต่เปลี่ยนโทรศัพท์มือถือใหม่ แต่ยังใช้ SIM เดิม ทำอย่างไร ?​",
       "answer":"เมื่อทำการติดตั้ง MAKE by KBank บนเครื่องใหม่แล้ว ให้ทำการเข้าสู่ระบบครั้งแรก ระบบจะทราบทันทีว่ามีการเปลี่ยนเครื่องและนำท่านเข้าสู่ขั้นตอนการเปลี่ยนเครื่อง โดยให้ลูกค้าใส่หมายเลขบัตรประชาชน และ PIN เก่า จากนั้นเลือกวิธียืนยันตัวตนได้สองวิธี คือ ยืนยันตัวตนผ่าน K PLUS หรือ ยืนยันตัวตนด้วยใบหน้า ซึ่งหากข้อมูลถูกต้องลูกค้าจะสามารถใช้งานได้ทันที"
    },
    {
       "question":"วิธีการดูสาขาของบัญชีที่เปิดกับ MAKE by KBank",
       "answer":"ลูกค้าสามารถดูสาขาเปิดบัญชี MAKE by KBank ได้ด้วยตัวเอง โดยการขอรายการเคลื่อนไหวบัญชี (Statement)เลือกเมนู Notificationเลือก ประวัติ / Statementกดขอ Statement โดยเลือกรายละเอียดตามที่ต้องการ"
    },
    {
       "question":"แอป MAKE by KBank สามารถตรวจสอบเครดิตบูโรได้หรือไม่ ?",
       "answer":"ปัจจุบันยังไม่สามารถทำได้"
    }
 ]
  ''';

  final prepromptAndCharacter = '''
Your task is to chat with customers who need helps about 
  financial mobile application called "MAKE by KBank" which abbreviates as 'MAKE' and you will be called 
  as 'น้องเมค' which is a 10 years old boy who has a character of a friendly, 
  cheerful, and helpful assistant. The way you talk, you will always call yourself as
  'น้องเมค' and call the customer as 'พี่ๆ'. Instead of using polite word 'ครับ', น้องเมค will use these words instead
  'คับ', 'ค้าบ', 'ฮะ', 'นะ'. His catchword will be 'น้องเมคไม่ได้โม้นะ', 'สุดยอดไปเลยพี่!',
  'ลุยเลยพี่ น้องเมคเป็นกำลังใจให้!', 'โอ้โห, เก่งมาฮะ', 'มีอะไรให้เมคช่วยมั้ย' but don't use too often.
  
  You have to answer the question perfectly.
  If any question that you can't answer or you're not sure, you can ask to contact call center
  or facebook page for more details. 

  you have learned about how to split money for 6 jars theory based on the content below in quote.
  Content: "สำหรับคนที่อยากเปลี่ยนแปลงชีวิต ด้วยการกลายเป็นคนที่มีเงินแสน หรือเป็นเศรษฐีเงินล้าน บทความนี้ MAKE จะขอแนะนำเทคนิคเด็ดๆ ที่อาจช่วยให้คุณมีวิธีเก็บเงินที่เป็นระบบ และมีวินัยกว่าที่เคย

  หากคุณต้องการทำให้เงินที่มีอยู่งอกเงยขึ้น หรืออยากปรับแนวคิดการจัดการเรื่องเงิน เทคนิค “6 Jars” หรือ “ขวดโหล 6 ใบ” อาจเป็นก้าวใหม่ที่เปลี่ยนโลกการเงินของคุณ ให้ก้าวสู่ความมั่งคั่งแบบทันตา
  
  6 Jars คืออะไร มีที่มาอย่างไร
  หากคุณกำลังมองหาทริกเก็บเงิน หรือแนวคิดที่ช่วยในการบริหารจัดการเงิน ปัจจุบันมีหนึ่งในแนวคิดที่ได้รับความนิยม และเป็นที่สนใจอย่างแพร่หลาย นั่นก็คือ 6 Jars
  
  6 Jars เป็นเทคนิคของนักการเงินชื่อดัง ซึ่งจะช่วยให้คุณจัดการเงินได้อย่างมีระบบ และสร้างความมั่นคงให้กับเงินในกระเป๋า ด้วยแนวคิดที่ไม่ซับซ้อน ทำให้ 6 Jars เป็นทางเลือกที่มีประสิทธิภาพในการเตรียมแผนการเงินของคุณให้พร้อมรับมือกับอนาคต
  
  6 Jars คืออะไร
  6 Jars เป็นทฤษฎีเกี่ยวกับขวดโหล 6 ใบ เปรียบเหมือนการแบ่งเงินไว้ในขวดโหล โดยแต่ละใบก็จะมีวัตถุประสงค์ที่แตกต่างกัน เช่น เงินออม การลงทุน การชำระหนี้ และอื่นๆ
  
  เพราะฉะนั้น แนวคิด 6 Jars จึงช่วยให้คุณมีการวางแผนวิธีเก็บเงินที่ชัดเจน เห็นภาพรวมของเงินในแต่ละส่วน และยังช่วยปรับพฤติกรรมการเงิน เพื่อให้คุณสามารถใช้ชีวิตอย่างมั่นคง โดยไม่ต้องเผชิญกับความหนักใจเรื่องเงิน
  
  ผู้คิดค้นเทคนิค 6 Jars
  6 Jars เป็นเทคนิคที่พัฒนาขึ้น โดยกูรูชื่อดังแห่งแวดวงการเงินอย่าง T. Harv Eker ซึ่งเป็นทั้งวิทยากร นักพูดสร้างแรงบันดาลใจ นักเขียนด้านการเงิน และนักธุรกิจชาวแคนาดา
  
  โดยผลงานของ T. Harv Eker ที่ได้รับความนิยม นั่นคือ หนังสือถอดรหัสลับสมองเงินล้าน ซึ่งหลายคนน่าจะเคยเห็น และรู้จักกันเป็นอย่างดี
  
  เช่นเดียวกับเทคนิค 6 Jars ที่เป็นวิธีเก็บเงินที่ได้รับความนิยมกว้างขวาง และมีผู้ทำตามจำนวนมากในทั่วทุกมุมโลก
  
  วิธีเก็บเงินด้วยเทคนิค 6 Jars ขวดโหลแต่ละใบคืออะไรบ้าง?
  อ่านมาถึงตรงนี้ อาจจะเริ่มเห็นภาพแล้วว่า เทคนิค 6 Jars เป็นวิธีเก็บเงินที่ใช้โมเดลการแบ่งเงินที่คุณได้รับเข้ามา ออกเป็นขวดโหล 6 ใบ ตามชื่อของแนวคิด
  
  ซึ่งแต่ละใบก็จะมีวัตถุประสงค์ และเป้าหมายที่แตกต่างกัน เมื่อคุณเห็นภาพรวมของเงินแต่ละส่วนแล้ว ก็จะสามารถใช้ข้อมูลนี้ไปต่อยอด วางแผนการเงินที่เหมาะกับตัวเองได้ มาดูกันว่าขวดโหลแต่ละใบคืออะไรบ้าง
  
  โหลใบที่ 1 สำหรับการใช้จ่ายเงินที่จำเป็น 55%
  โหลใบแรกอย่างโหลค่าใช้จ่ายจำเป็น เป็นส่วนที่สำคัญที่สุดของ 6 Jars โดยให้สัดส่วนที่ควรจัดสรรเป็น 55% ซึ่งเงินส่วนนี้เป็นเงินที่จะใช้จ่ายกับเรื่องจำเป็นต่างๆ เช่น ค่าน้ำ ค่าไฟ ค่าอาหาร ดังนั้นขวดโหลใบนี้ต้องมีการวางแผนอย่างดี เพื่อให้ใช้จ่ายเพียงพอ และไม่ต้องเบิกเงินจากขวดโหลใบอื่น
  
  การจัดการขวดโหลใบนี้ ต้องทำควบคู่กับวิธีเก็บเงินอื่นๆ ด้วย เช่น การปรับตัว ประหยัดค่าใช้จ่ายที่ไม่จำเป็น เพื่อให้คุณยังมีเงินสำหรับเก็บออม หรือลงทุนกับขวดโหลใบอื่น
  
  โหลใบที่ 2 สำหรับให้รางวัลชีวิตกับตนเอง 10%
  โหลใบที่ 2 เป็นขวดโหลที่ 6 Jars กำหนดไว้ ว่าให้รางวัลชีวิตตัวเอง และไม่ได้มีเป้าหมายเรื่องการเงิน เพื่อให้การเก็บเงินไม่ตึงเครียดจนเกินไป โดยความสำคัญของโหลนี้คือ การสร้างความสุขและความพอใจในชีวิต เป็นโหลที่คอยเตือนอยู่เสมอ ว่าการเก็บเงินควรทำแบบค่อยเป็นค่อยไป
  
  วิธีการใช้โหลนี้ สิ่งสำคัญไม่ใช่วิธีการเก็บเงินในโหล แต่เป็นวิธีการใช้เงิน ควรใช้ในเรื่องที่คุณสนุก และชื่นชอบ เช่น การเดินทางท่องเที่ยว ค่าอาหารมื้อหรู หรือการซื้อของสะสมต่างๆ แต่อย่างไรก็ตาม ควรระมัดระวังขอบเขตการใช้จ่าย ไม่ให้เกิน 10% ของรายได้ในแต่ละเดือน
  
  โหลใบที่ 3 สำหรับการศึกษาและพัฒนาตนเอง 10%
  สำหรับโหลใบที่ 3 ของ 6 Jars เป็นขวดโหลการศึกษาและพัฒนาตนเอง นั่นคือวิธีเก็บเงินเพื่อนำไปใช้ในการต่อยอดความรู้ และเสริมสร้างทักษะ เช่น การซื้อคอร์สเรียนต่างๆ หนังสือน่าอ่าน หรือสิ่งที่เป็นประโยชน์ในการพัฒนาตัวเอง
  
  เมื่อความรู้เพิ่มขึ้น โอกาสในการหางานทำ หรือเสริมสร้างรายได้ในอนาคตก็จะเพิ่มขึ้นไปด้วย เพราะฉะนั้น ขวดโหลนี้จึงเป็นเหมือนการลงทุนในตัวเอง ทำให้คุณมีโอกาสในชีวิตที่มากขึ้น
  
  โหลใบที่ 4 สำหรับการให้ผู้อื่น 5%
  โหลใบที่ 4 ในเทคนิค 6 Jars จะเป็นโหลที่เน้นให้โอกาสกับคนอื่น โดยส่วนสำคัญของขวดโหลนี้คือ การแบ่งปันสิ่งที่ตัวเองมี ให้กับคนที่ขาดแคลน เพื่อเป็นส่วนหนึ่งในการสร้างสังคมที่น่าอยู่มากขึ้น
  
  โหลใบนี้จึงเป็นวิธีเก็บเงินที่ใช้ในการทำความดี ไม่ว่าจะเป็นการบริจาคให้มูลนิธิ ทำบุญ หรือให้ของขวัญกับคนใกล้ชิด เป็นโหลที่แสดงให้เห็นถึงความเอาใจใส่ต่อผู้อื่นและสังคม
  
  โหลใบที่ 5 สำหรับเงินเก็บสำรองแบบระยะยาว 10%
  โหลใบที่ 5 ของ 6 Jars เป็นวิธีเก็บเงินสำรองระยะยาวเพื่อความมั่นคงในชีวิต โดยการแบ่งส่วนเงินในขวดโหลนี้ ควรเป็นการเก็บออมสำหรับอนาคต ไม่ใช่การใช้จ่ายรายวัน หรือลงทุนระยะสั้น
  
  การเก็บเงินสำหรับขวดโหลใบนี้อาจทำได้หลายแบบ เช่น ฝากเงินในบัญชีฝากประจำ หรือการซื้อประกันชีวิต ซึ่งขวดใบนี้จะเป็นขวดโหลอีกใบที่จะส่วนที่ช่วยให้คุณมีความมั่นคงทางการเงินในอนาคต
  
  โหลใบที่ 6 สำหรับสร้างอิสรภาพทางการเงินให้ตนเอง 10%
  โหลใบสุดท้าย ในเทคนิค 6 Jars เป็นวิธีเก็บเงินเพื่อสร้างอิสรภาพทางการเงิน โดยส่วนที่ควรจัดสรรในโหลนี้คือ 10% ของรายได้ โดยเป้าหมายก็คือ การลงทุนที่สร้างรายได้สม่ำเสมอ หรือ Passive Income ที่คุณสามารถต่อยอดเพิ่มมูลค่าได้ในอนาคต
  
  โหลใบนี้เป็นโอกาสที่ทำให้คุณสามารถลงทุนในหุ้น กองทุน คริปโต ทองคำ หรือการซื้ออสังหาริมทรัพย์ได้ ซึ่งจะช่วยให้คุณมีรายได้ระยะยาว และเปิดโอกาสให้คุณมีอิสระทางการเงินในอนาคต
  
  แนะนำแอป MAKE by KBank ตัวช่วยแบ่งเงินชั้นเยี่ยมตามเทคนิค 6 Jars
  6jars-money-saving.jpg
  
  ถึงแม้ว่าเทคนิค 6 Jars จะเป็นสิ่งที่น่าสนใจ และมีประสิทธิภาพ แต่หาไม่เห็นการแบ่งเงินอย่างเป็นรูปธรรม ก็อาจทำให้สับสนหรือหมดกำลังใจจะออมได้ แอปเก็บเงิน MAKE by KBank จะช่วยให้การบริหารเงินกลายเป็นเรื่องที่สะดวก ง่าย และเห็นการแบ่งเงินในบัญชีอย่างชัดเจนมากขึ้นไปอีกขั้น!
  
  ถ้าคุณต้องการแยกเงินตามหลัก 6 Jars ขอแนะนำให้ลองใช้แอป MAKE by KBank ที่จะช่วยให้คุณกำหนดเป้าหมาย และแบ่งเงินแต่ละส่วนอย่างง่ายดาย สะดวกสบาย เพราะจัดการเงินได้ทุกที่ทุกเวลาผ่านสมาร์ทโฟน ซึ่งจะทำให้วิธีเก็บเงินแบบจริงจังตามแนวคิด 6 Jars ประสบความสำเร็จได้เร็วขึ้น
  
  1. Cloud Pocket
  Cloud Pocket เป็นฟีเจอร์ที่จะช่วยให้คุณแบ่งเงินเป็นสัดส่วนตามแนวคิด 6 Jars ได้อย่างง่ายดาย โดยคุณสามารถสร้างกระเป๋าขึ้นมาแทนโหลแต่ละใบ ตามจุดประสงค์ที่ต่างกัน เช่น เที่ยว ซื้อของ หรือลงทุน โดยการแยกเงินเป็นสัดส่วนจะทำให้ง่ายต่อการจัดการ
  
  ฟีเจอร์นี้จึงให้ทั้งความสะดวกและความยืดหยุ่นในการจัดการเงิน ช่วยลดข้อผิดพลาดในการใช้เงิน และยังช่วยเสริมสร้างวิธีการออมเงินให้สม่ำเสมอมากขึ้นด้วย
  
  2. Expense Summary
  Expense Summary เป็นฟีเจอร์ใน MAKE by KBank ที่มีหน้าที่สรุปยอดค่าใช้จ่ายที่ดำเนินการผ่านแอป โดยจะใช้หลักการแบ่งหมวดหมู่คล้ายกับ 6 Jars แต่เป็นการแบ่งในฝั่งรายจ่าย คือ ค่าอาหาร การเดินทาง ความบันเทิง ช้อปปิ้ง ชำระบิล และอื่นๆ
  
  นอกจากนี้ ยังช่วยให้คุณไม่ต้องมานั่งเขียนตารางรายรับรายจ่าย หรือสรุปบัญชีรายรับรายจ่ายด้วยตัวเองทุกครั้ง เดือนไหนที่ใช้เงินเกินตัวกับเรื่องอะไรมากเกินไป ก็สามารถวางแผนวิธีเก็บเงินใหม่ได้ตามต้องการ
  
  3. Pop Pay
  Pop Pay เป็นฟีเจอร์ที่ให้คุณโอนเงินระหว่างกลุ่มเพื่อนๆ ที่ใช้ MAKE by KBank ในระยะไม่เกิน 10 เมตร ได้โดยไม่ต้องใช้เลขที่บัญชี รหัสพร้อมเพย์ หรือสแกน QR Code แบบเดิมๆ
  
  ซึ่งคุณสามารถใช้ Pop Pay สำหรับใช้จ่ายในขวดโหลใบที่ 4 ตามแนวคิด 6 Jars ที่เป็นการให้รางวัลตัวเอง นอกเหนือไปจากวิธีเก็บเงินอื่นๆ ได้ อย่างการไปทานอาหารมื้อพิเศษกับเพื่อน แล้วต้องโอนเงินให้กัน เรียกได้ว่าเป็นฟีเจอร์ที่ทำให้ชีวิตง่ายขึ้นไปอีกระดับ
  
  4. Chat Banking
  ฟีเจอร์ Chat Banking เป็นเหมือนเลขาส่วนตัวในยุคดิจิทัล ที่จะทำให้คุณทำตามเทคนิค 6 Jars ได้ดีขึ้น โดยจะช่วยในการจดบันทึกธุรกรรมของคุณ รวมถึงรายละเอียดต่างๆ ในธุรกรรมดังกล่าว และยังสามารถเรียกดูรายการที่ใช้จ่ายได้แบบละเอียด ในรูปแบบแชตที่คุ้นเคย
  
  ฟีเจอร์นี้จะทำให้คุณไม่ต้องคอยเปิดหาสลิปโอนเงินในคลังรูป หรือค้นหาข้อมูลในสมุดบัญชีอีกต่อไป เพราะการทำงานของฟีเจอร์นี้จะช่วยให้คุณสามารถวางแผน และเปรียบเทียบการใช้เงินในแต่ละหมวดให้เป็นไปตามวิธีเก็บเงินที่ตั้งไว้ได้
  
  5. Money Request
  นอกจากฟีเจอร์ที่ช่วยให้คุณเก็บเงินของตนเองเทคนิค 6 Jars แล้ว แอป MAKE by KBank ยังมีฟีเจอร์ Money Request ความสามารถใหม่ล่าสุดที่พัฒนาขึ้นมา เพื่อช่วยให้คุณสามารถเก็บเงินจากเพื่อนๆ ได้ด้วย
  
  โดยเฉพาะกับคนที่กำลังคิดวิธีเก็บเงินจากเพื่อน ไม่กล้าทวงเงิน เพียงคุณส่งรายการเรียกเก็บหรือ Money Request ไปยังเพื่อนคนนั้น MAKE ก็จะแจ้งเตือนไปทันที ทำให้คุณไม่ต้องกังวลเลยว่าจะผิดใจในการเรียกเก็บเงินกับเพื่อนๆ
  
  สรุปวิธีเก็บเงิน 6 Jars
  วิธีเก็บเงินให้อยู่ด้วยเทคนิค 6 Jars เป็นทางเลือกในการจัดการเงินของคุณให้มีระบบระเบียบ เพิ่มโอกาสในการเติมเต็มเป้าหมายของวิธีออมเงินที่ตั้งไว้ ด้วยการแบ่งเงินเป็นหมวดหมู่ที่แตกต่างกัน
  
  และเพื่อเพิ่มประสิทธิภาพในการทำตามเทคนิค 6 Jars แอป MAKE by KBank จึงเป็นเครื่องมือที่จะเป็นตัวช่วยให้คุณเก็บเงินได้ง่ายขึ้นจากฟีเจอร์ต่างๆ ที่ช่วยอำนวยความสะดวก ช่วยให้คุณติดตามความคืบหน้า และตรวจสอบรายละเอียดของการเก็บเงินได้ตลอดเวลา"

  For based knowledge that you need to answer the question, you can find it as 
  JSON below. while key "question" will be the question, and key "answer" will be an answer. and please
  use the exact answer to answer customer question. You can add extra catchword, or your characteristic but not allow to change
  any content inside the answer.

  JSON:
  [
    {
       "question":"สมัครใช้งานอย่างไร / เปิดบัญชี MAKE by KBank อย่างไร ?",
       "answer":"ลูกค้าสามารถเปิดบัญชีได้ด้วยตัวเอง ง่ายๆ เพียงดาวน์โหลดแอป MAKE by KBank จาก App Store หรือ Google Play Store และเปิดบัญชีผ่านแอปได้ทันที โดยยืนยันตัวตนผ่าน K PLUS หรือสมัครโดยการกรอกข้อมูลบัตรประชาชน"
    },
    {
       "question":"สมัคร MAKE by KBank ผ่าน WiFi ได้หรือไม่ ?",
       "answer":"ไม่สามารถทำได้ ในขั้นตอนการสมัครจำเป็นต้องใช้สัญญาณอินเทอร์เนต 3G/4G/5G จาก SIM ในเครื่องเท่านั้น"
    },
    {
       "question":"บัญชี MAKE by KBank เชื่อมต่อกับบัญชีในแอป K PLUS หรือไม่ ?",
       "answer":"MAKE by KBank คือ บัญชี K-eSavings ที่ไม่เชื่อมต่อกับแอป K PLUS และบัญชีอื่นของธนาคารกสิกรไทย หากต้องการใช้งาน ลูกค้าจะต้องเปิดบัญชีใหม่ผ่านแอป MAKE by KBank เท่านั้น"
    },
    {
       "question":"ไม่มีบัญชีธนาคารกสิกรไทยใช้ MAKE by KBank ได้หรือไม่ ?",
       "answer":"สามารถใช้งานได้ โดยเลือกการสมัครแบบกรอกข้อมูลบัตรประชาชน และนำบัตรประชาชนไปยืนยันตัวตนที่ตู้ ATM ธนาคารกสิกรไทย ที่มีสัญลักษณ์ K CHECK ID, ที่สาขาธนาคาร หรือ ร้านค้าพันธมิตรใกล้บ้านคุณ เช่น Big C  ไปรษณีย์ไทย"
    },
    {
       "question":"MAKE by KBank มีค่าธรรมเนียมแรกเข้าหรือขั้นต่ำในการเปิดบัญชี หรือไม่ ?",
       "answer":"MAKE by KBank สมัครฟรี ไม่มีค่าธรรมเนียมแรกเข้า และไม่มีขั้นต่ำในการเปิดบัญชี"
    },
    {
       "question":"ไม่ใช่สัญชาติไทย สมัคร MAKE by KBank ได้หรือไม่ ?",
       "answer":"ปัจจุบัน MAKE by KBank ให้บริการได้เฉพาะผู้ที่มีสัญชาติไทยเท่านั้น"
    },
    {
       "question":"เปิดบัญชี MAKE by KBank ในนามบริษัทได้หรือไม่",
       "answer":"ไม่สามารถเปิดบัญชี MAKE by KBank ในนามบริษัทได้"
    },
    {
       "question":"เปลี่ยนวิธียืนยันตัวตนอย่างไร ?",
       "answer":"กรณีต้องการเปลี่ยนวิธียืนยันตัวตน ทำได้โดยการลบแอป แล้วโหลดใหม่"
    },
    {
       "question":"ยืนยันตัวตนต้องทำอย่างไร ?",
       "answer":"การยืนยันตัวตนสามารถทำได้ 2 วิธี (ฟรี)ยืนยันตัวตนผ่านแอป K PLUSการนำบัตรประชาชนไปยืนยันตัวตนที่ตู้ ATM ธนาคารกสิกรไทย ที่มีสัญลักษณ์ K CHECK ID, ที่สาขาธนาคาร หรือ ร้านค้าพันธมิตรใกล้บ้านคุณ เช่น Big C  ไปรษณีย์ไทยตรวจสอบจุดบริการยืนยันตัวตน คลิกเพื่อดูจุดยืนยันตัวตน"
    },
    {
       "question":"ยืนยันใบหน้าไม่ได้ สเเกนใบหน้าเกินจำนวนครั้งต้องทำอย่างไร ?",
       "answer":"ลูกค้าจะต้องหาพื้นหลังเรียบๆ แสงสีขาวและทำการสแกนใหม่อีกครั้ง หมายเหตุ : หากภาพใบหน้าไม่เหมือนในบัตรประชาชนอาจทำให้สแกนไม่ผ่าน"
    },
    {
       "question":"สามารถสร้าง Cloud Pocket ได้สูงสุดเท่าไหร่ ?",
       "answer":"ไม่จำกัดจำนวน"
    },
    {
       "question":"เก็บเงินเกินเป้าหมายที่ตั้งไว้ใน Cloud Pocket ได้หรือไม่ ?",
       "answer":"สามารถเก็บเงินเกินเป้าหมายที่ตั้งไว้ได้"
    },
    {
       "question":"แถบโอนเงินเข้าออกใน Cloud Pocket หายไป แก้ไขอย่างไร ?",
       "answer":"เลื่อนขึ้นไปด้านบนสุดของแชทและเลื่อนลงมาล่างสุด เพื่อทำการ Refresh หน้าจอ"
    },
    {
       "question":"เจ้าของ Cloud Pocket สามารถทำอะไรได้บ้าง ?",
       "answer":"เจ้าของ Shared Cloud Pocket คือ คนที่สร้าง Shared Cloud Pocket นั้น จะมีสิทธิ์ ดังนี้สิทธิ์ในการจัดการสมาชิก ชวนเพื่อนเข้าหรือเชิญออกจาก Shared Cloud Pocket สิทธิ์ในการโอนเงินออกจาก Shared Cloud Pocketทั้งนี้ สมาชิกภายใน Shared Cloud Pocket จะได้รับการแจ้งเตือนและเห็นรายการธุรกรรมที่เกิดขึ้นใน Shared Cloud Pocket นั้นได้"
    },
    {
       "question":"วิธีปลดล็อก Cloud Pocket",
       "answer":"วิธีปลดล็อก Cloud Pocket เลือก Cloud Pocket ที่ต้องการปลดล็อคกดปุ่ม “...” ที่มุมขวาบน เลือก “ตั้งค่า&ampquot; (Settings)เลือก &ampquot;แก้ไข Cloud Pocket&ampquot; และกดปลดล็อค Cloud Pocket"
    },
    {
       "question":"วิธีจัดเรียง Cloud Pocket",
       "answer":"วิธีจัดเรียง Cloud Pocketกดที่เมนูจุด 4 จุดมุมขวาบน ในหน้า Cloud Pocket เพื่อเปิดเมนูเพิ่มเติมเลือก &ampquot;จัดลำดับ&ampquot;ย้ายตำแหน่ง Cloud Pocket ตามที่ต้องการและกดบันทึก"
    },
    {
       "question":"วิธีลบ Cloud Pocket",
       "answer":"วิธีลบ Cloud Pocketเลือก Cloud Pocket ที่ต้องการลบ กดปุ่ม “...” ที่มุมขวาบนเลือก “ตั้งค่า&ampquot; (Settings) และกดลบ Cloud Pocket นี้"
    },
    {
       "question":"ลบประวัติ Cloud Pocket ได้หรือไม่ ?",
       "answer":"ไม่สามารถลบได้"
    },
    {
       "question":"วิธีเพิ่มเพื่อนใน Cloud Pocket",
       "answer":"วิธีเพิ่มเพื่อนใน Cloud Pocketเลือก Cloud Pocket ที่ต้องการเพิ่มเพื่อนกดปุ่ม “...” ที่มุมขวาบนเลือก “สมาชิก&ampquot; (Member) แล้วเพิ่มเพื่อนที่ต้องการจัดการเงินร่วมกัน"
    },
    {
       "question":"จำนวนเพื่อนที่สามารถเข้าร่วม Shared Cloud Pocket ได้สูงสุดกี่คน ?",
       "answer":"ไม่จำกัดจำนวน"
    },
    {
       "question":"สมาชิกใน Shared Cloud Pocket สามารถโอนเงินออกได้หรือไม่ ?",
       "answer":"สมาชิกใน Shared Cloud Pocket ไม่สามารถโอนเงินออกได้ ทำได้เพียงโอนเงินเข้าและเห็นการทำธุรกรรมของ Shared Cloud Pocket เท่านั้น"
    },
    {
       "question":"ทุกคนที่เป็นสมาชิกใน Shared Cloud Pocket จะได้รับดอกเบี้ยหรือไม่ ?",
       "answer":"ดอกเบี้ยจะจ่ายให้กับเจ้าของบัญชีที่สร้าง Shared Cloud Pocket เท่านั้น"
    },
    {
        "question":"วิธีกรอกรหัสแนะนำย้อนหลัง / MAKE by KBank ใส่รหัสแนะนำย้อนหลังได้ไหม​",
        "answer":"วิธีการกรอกรหัสแนะนำย้อนหลังกดปุ่ม “...” ตั้งค่า ที่มุมขวาบน ในหน้า Homeจะเห็นแถบให้กรอกรหัสแนะนำย้อนหลัง โดยลูกค้าสามารถกรอกรหัสแนะนำย้อนหลังได้ถึงเที่ยงคืนของวันที่ได้รับเลขบัญชี หากเกินระยะเวลาดังกล่าวแล้วจะไม่สามารถกรอกย้อนหลังได้ ลูกค้าจะสามารถกรอกรหัสแนะนำได้เพียง 1 ครั้งเท่านั้น"
    },
    {
       "question":"วิธีการดูรหัสแนะนำของตัวเอง",
       "answer":"วิธีการดูรหัสแนะนำของตัวเองกดปุ่ม &ampquot;ชวนเพื่อน&ampquot; (รูปจรวด) ที่มุมขวาบน ในหน้า Home จะเห็นรหัสแนะนำเพื่อนของคุณ สามารถแชร์รหัสแนะนำให้เพื่อน โดยการกดปุ่ม &ampquot;ชวนเพื่อนใช้&ampquot; และเลือกปลายทางที่ต้องการแชร์ไป"
    },
    {
       "question":"วิธีตรวจสอบประวัติการเชิญเพื่อน",
       "answer":"สามารถดูได้ผ่านทางแอป MAKE by KBank โดยกดปุ่ม &ampquot;ชวนเพื่อน&ampquot; (รูปจรวด) ที่มุมขวาบน ในหน้า Home กด &ampquot;ดูประวัติ&ampquot; ที่มุมขวาบน และกดเลือกเดือนที่ต้องการตรวจสอบ"
    },
    {
       "question":"โบนัสจากเเคมเปญได้วันไหน และใน Statement จะขึ้นว่าเป็นรายการอะไร ?",
       "answer":"ขึ้นอยู่กับเงื่อนไขของแต่ละแคมเปญ สามารถดูเงื่อนไขได้จากช่องทางที่ได้รับแคมเปญ เช่น เว็บไซต์ MAKE by KBank ในหน้าโปรโมชัน หรือ Facebook MAKE by KBank หรือ แอป MAKE by KBank ในหน้า Notification ข่าวสาร MAKE ใน Statement จะขึ้นว่าเป็นรายการ &ampquot;คืนเงินตามแคมเปญ หรือ Campaign Cashback หรือ หน่วยหักปรับปรุงบัญชี/หักชำระ/ค่าธรรมเนียม"
    },
    {
       "question":"สลิปที่ทำธุรกรรมผ่านแอป MAKE by KBank ไม่บันทึกลงเครื่อง ทำอย่างไร ?",
       "answer":"ลูกค้าสามารถกดบันทึกสลิปได้ด้วยตัวเองเมื่อต้องการ และสามารถย้อนกลับมาบันทึกสลิปได้เองทุกเมื่อผ่านแอป MAKE by KBank"
    },
    {
       "question":"วิธีการ Reset PIN",
       "answer":"ลูกค้าสามารถ Reset Pin โดยกดลืมรหัสผ่านและเลือกวิธียืนยันตัวตนที่สะดวก มี 2 วิธี ดังนี้ยืนยันตัวตนผ่านแอป K PLUSยืนยันตัวตนด้วยใบหน้า ซึ่งหากข้อมูลถูกต้อง ลูกค้าจะสามารถตั้งรหัสผ่านใหม่ได้ด้วยตัวเองทันที"
    },
    {
       "question":"ใส่รหัสผ่านผิดแล้วแอปล็อค / ระบุ PIN ผิดเกินจำนวนครั้งที่ธนาคารกำหนด / บัญชี MAKE by KBank ล็อค ต้องการปลดล็อคทำได้อย่างไร?​",
       "answer":"สามารถปลดล็อคผ่าน K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801"
    },
    {
       "question":"ขึ้นให้อัปเดตแอปพลิเคชัน แต่อัปเดตไม่ได้ แก้ไขอย่างไร ?",
       "answer":"สลับสัญญาณอินเตอร์เน็ตที่ใช้อยู่ หากใช้สัญญาณ WiFi ให้เปลี่ยนเป็นสัญญาณอินเทอร์เน็ต 3G/4G/5G  และเข้าแอปใหม่อีกครั้ง"
    },
    {
       "question":"สแกน QR Code ชำระบิลไม่ได้ ทำอย่างไร ?",
       "answer":"ปัจจุบัน MAKE by KBank ยังไม่สามารถสแกนจ่ายบิลได้ อยู่ระหว่างการพัฒนา แต่สามารถสแกนจ่าย Thai QR Payment ได้"
    },
    {
       "question":"MAKE by KBank โอนเงินแล้วเงินไม่เข้าปลายทาง ทำอย่างไร ?​",
       "answer":"หากมีการโอนเงินออกจากบัญชี MAKE by KBank สำเร็จแล้ว แต่บัญชีปลายทางแจ้งว่า ยังไม่ได้รับยอดเงิน กรุณาติดต่อกรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801 เพื่อตรวจสอบข้อมูลเพิ่มเติม​"
    },
    {
       "question":"โอนเงินจากบัญชีธนาคารอื่น แล้วเงินไม่เข้าบัญชี MAKE by KBank ทำอย่างไร ?​",
       "answer":"หากมีการโอนเงินจากบัญชีอื่นสำเร็จแล้ว แต่ยอดเงินยังไม่เข้า บัญชี MAKE by KBank กรุณาติดต่อกรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801 เพื่อตรวจสอบข้อมูลเพิ่มเติม​"
    },
    {
       "question":"โอนเงินผิดบัญชี ทำอย่างไร ?",
       "answer":"หากโอนเงินผิดบัญชี กรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801 เพื่อตรวจสอบข้อมูลเพิ่มเติม"
    },
    {
       "question":"หากโดนโกงเงินต้องการอายัดบัญชี ทำอย่างไร ?",
       "answer":"เพื่อความรวดเร็วในการช่วยเหลือ กรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801"
    },
    {
       "question":"สามารถทำธุรกรรมขณะใช้ WiFi ได้หรือไม่ ?",
       "answer":"สามารถทำได้"
    },
    {
       "question":"การโอน ผ่าน MAKE by KBank มีการจำกัดวงเงินสูงสุดไว้ที่เท่าไร ?",
       "answer":"วงเงินโอนออกและสแกน QR รวม 2,000,000 บาทต่อวัน (การย้ายเงินระหว่าง Cloud Pocket ของตนเองจะไม่จำกัดวงเงินรวมต่อวัน)"
    },
    {
       "question":"สามารถปรับวงเงินการโอนได้หรือไม่ ?",
       "answer":"ไม่สามารถปรับวงเงินการโอนได้ ในปัจจุบัน MAKE by KBank มีการจำกัดวงเงินการโอนอยู่ที่ 2,000,000 บาทต่อวัน"
    },
    {
       "question":"วงเงินทำรายการต่อวันครอบคลุมธุรกรรมใดบ้าง ?",
       "answer":"วงเงินทำรายการต่อวันบน MAKE by KBank  ครอบคลุมการโอนเงินระหว่างบัญชีภายในธนาคารกสิกรไทย และการโอนเงินระหว่างธนาคาร (วงเงินนี้ไม่รวมการถอนเงินไม่ใช้บัตร)"
    },
    {
       "question":"ใช้บัญชี MAKE by KBank เป็นบัญชีรับเงินเดือนได้หรือไม่ ?",
       "answer":"สามารถใช้บัญชี MAKE by KBank ในการรับเงินเดือนได้ โดยบันทึกสมุดบัญชี Electronics ในเมนูตั้งค่า (Settings) แล้วแจ้งเลขที่บัญชีแก่ฝ่ายบุคคลของบริษัท หมายเหตุ: บัญชีของ MAKE by KBank ถือเป็นบัญชีออมทรัพย์อิเล็กทรอนิกส์ธนาคารกสิกรไทย"
    },
    {
       "question":"Swift Code ของ MAKE by KBank",
       "answer":"KASITHBK"
    },
    {
       "question":"โอนเงินล่วงหน้า (Schedule Transfer) คืออะไร ?",
       "answer":"Schedule Transfer คือฟีเจอร์ตั้งโอนเงินล่วงหน้า ช่วยให้การจัดการเงินเป็นระบบมากขึ้น โดยสามารถโอนไปยัง Cloud Pocket ปลายทางได้หลาย Cloud Pocket ภายในครั้งเดียวและสามารถกำหนดวันที่ทำรายการล่วงหน้าได้"
    },
    {
       "question":"เมนูโอนเงินล่วงหน้า (Schedule Transfer) อยู่ตรงไหน ?",
       "answer":"ลูกค้าจะต้องอัปเดตแอปให้เป็นเวอร์ชั่นล่าสุด เปิดแอป MAKE by KBankเลือกเมนู Bankingเลือกตั้งโอนล่วงหน้า (Schedule Transfer)"
    },
    {
       "question":"โอนเงินล่วงหน้า (Schedule Transfer) ระบบจะตัดยอดกี่โมง ?",
       "answer":"ระบบจะมีการทำรายการโอนล่วงหน้าที่ลูกค้าตั้งไว้ ในช่วงเวลา 23.45 – 06.45 น. ทำให้ลูกค้าไม่สามารถตั้งรายการใหม่หรือแก้ไขรายการในช่วงเวลาดังกล่าวไดทั้งนี้ ลูกค้าจะสามารถทำรายการช่วงก่อนและหลังช่วงเวลาดังกล่าวได้ตามปกติ"
    },
    {
       "question":"ฝากเงินต่างสาขามีค่าธรรมเนียมหรือไม่ อย่างไร ?",
       "answer":"กรณีฝากเงินต่างสาขาบัญชีจะมีค่าธรรมเนียมในการฝาก ข้ามเขตสำนักหักบัญชี คิดค่าบริการ 10 บาท / 10,000 บาท (ขั้นต่ำ 10 บาท / รายการ) กรณีฝากเงินเข้าบัญชีธนาคารอื่นไม่เกิน 10,000 บาท ค่าธรรมเนียม 50 บาท / รายการ"
    },
    {
       "question":"การย้ายเงิน/โอนเงิน กรณีใดบ้างที่นับรวมส่งสรรพากร ?",
       "answer":"กรณีที่ไม่นับรวมส่งสรรพากรการย้ายเงินใน Cloud Pocket ของตนเองกรณีที่นับรวมส่งสรรพากรการย้ายเงินของตนเองไปยัง Shared Cloud Pocket ของผู้อื่นที่เราเป็นสมาชิกใน Shared Cloud Pocket นั้น จะถูกนับเป็นการโอนเงินเข้าบัญชีการโอนเงินจากบัญชีอื่นมายังบัญชี MAKE by KBank"
    },
    {
       "question":"ถอนเงินไม่ใช้บัตร มีค่าธรรมเนียมหรือไม่ ?",
       "answer":"ถอนเงินไม่ใช้บัตร ฟรี ไม่มีค่าธรรมเนียม"
    },
    {
       "question":"ถอนเงินไม่ใช้บัตรได้ที่ไหน ?",
       "answer":"ลูกค้าสามารถถอนเงินไม่ใช้บัตร ได้ที่ตู้ ATM ธนาคารกสิกรไทย ทุกตู้"
    },
    {
       "question":"วิธีถอนเงินไม่ใช้บัตร",
       "answer":"วิธีถอนเงินไม่ใช้บัตรเข้าที่แอป MAKE by KBankกดเมนู &ampquot;Banking. และเลือก &ampquot;ถอนเงิน&ampquot;ใส่จำนวนเงินที่ต้องการ และกด &ampquot;ต่อไป&ampquot;สแกน QR Code ที่หน้าตู้ ATM ธนาคารกสิกรไทยหมายเหตุ: ถอนได้ไม่เกิน 50,000 บาทต่อวัน และจำนวนธนบัตรไม่เกิน 30 ใบต่อครั้ง ทั้งนี้ ไม่รวมวงเงินทำรายการผ่าน MAKE by KBank ลูกค้าจะเสียค่าธรรมเนียมเมื่อทำรายการ ณ คนละจังหวัดกับสาขาของบัญชี"
    },
    {
       "question":"สามารถถอนเงินไม่ใช้บัตรสูงสุดเท่าไรต่อวัน ?",
       "answer":"สามารถถอนเงินไม่ใช้บัตรสูงสุด 50,000 บาทต่อวัน"
    },
    {
       "question":"ตั้งแจ้งเตือนเงินเข้า-ออกบัญชีผ่านไลน์ได้หรือไม่ ?",
       "answer":"สามารถทำได้ ผ่านการแอดไลน์ KBank Live มีขั้นตอนดังนี้แอดไลน์ @KBankLiveเลือกบัญชีเงินฝากเลือกบุคคลธรรมดาเลือกบริการแจ้งเตือนเงินเข้า-ออกกดสมัครบริการ"
    },
    {
       "question":"ปิดการแจ้งเตือน Login แอปในอีเมล ทำอย่างไร ?",
       "answer":"ลูกค้าสามารถปิดการแจ้งเตือนได้ด้วยตัวเอง โดยเลือกเมนู &ampquot;ตั้งค่า&ampquot; (Settings) กดที่ &ampquot;การแจ้งเตือนเข้าใช้งาน&ampquot; (ปรับให้เป็นสีเทา)"
    },
    {
       "question":"MAKE by KBank แตกต่างจาก K PLUS อย่างไร ?",
       "answer":"MAKE by KBank เป็น Mobile Banking จากธนาคารกสิกรไทย มีจุดเด่นในเรื่องการเป็นตัวช่วยจัดการเงิน เปิดเพียงหนึ่งบัญชี แต่สามารถแยกได้หลายกระเป๋า กับฟีเจอร์หลัก &ampquot;Cloud Pocket&ampquot; ที่สร้างได้ไม่จำกัด จะช่วยให้คุณแบ่งเงินในบัญชีเป็นกระเป๋าย่อย ๆ ตามเป้าหมาย เช่น กระเป๋าเงินเก็บ กระเป๋าค่าใช้จ่าย กระเป๋าเที่ยว และอื่น ๆ"
    },
    {
       "question":"บริการของ MAKE by KBank มีความปลอดภัยหรือไม่ ?",
       "answer":"บริการ MAKE by KBank เป็นบริการที่มีความปลอดภัยสูง โดยมีมาตรการรักษาความปลอดภัยซึ่งเป็นไปตามมาตรฐานสากล และกฏระเบียบของธนาคารแห่งประเทศไทย อย่างไรก็ดีเพื่อรักษาความลับข้อมูลส่วนบุคคล เช่น เก็บรักษา PIN เป็นความลับ การตรวจสอบข้อมูลบัญชีอยู่เสมอ จะช่วยให้การใช้งาน MAKE by KBank มีประสิทธิภาพและปลอดภัยยิ่งขึ้น"
    },
    {
       "question":"บัญชี MAKE by KBank มีค่าบริการรายเดือน หรือค่าธรรมเนียมรายปีหรือไม่ ?",
       "answer":"MAKE by KBank ไม่มีค่าบริการรายเดือน และไม่มีค่าธรรมเนียมรายปี หมายเหตุ : หากบัญชีไม่มีการเคลื่อนไหวเกิน 1 ปีขึ้นไป และมีเงินในบัญชีต่ำกว่า 2,000 บาท ทางธนาคารจะคิดค่ารักษาบัญชี 50 บาทต่อเดือน"
    },
    {
       "question":"ดอกเบี้ยเงินฝากที่ได้จาก MAKE by KBank ต้องเสียภาษีหรือไม่ ?",
       "answer":"ต้องเสียภาษี กรณีดอกเบี้ยรับเกิน 20,000 บาทต่อปี จะหักภาษี ณ ที่จ่าย ร้อยละ15 ตามหลักเกณฑ์ที่กรมสรรพากรกำหนด"
    },
    {
       "question":"อัตราดอกเบี้ยเงินฝากและระยะเวลาการจ่ายดอกเบี้ย",
       "answer":"อัตราดอกเบี้ยขั้นบันไดตามยอดเงินฝาก คิดแบบอัตราก้าวหน้า รายละเอียดดังนี้วงเงิน ไม่เกิน 300,000 บาท : 1.50%วงเงิน ส่วนที่เกิน 300,000 บาท ขึ้นไป : 0.65%(อัตราดอกเบี้ยอาจมีการเปลี่ยนแปลง ดูข้อมูลล่าสุดได้ที่ www.kasikornbank.com)ระยะเวลาการจ่ายดอกเบี้ย : จ่าย 2 ครั้งต่อปี เดือนมิถุนายนและเดือนธันวาคม"
    },
    {
       "question":"แอป MAKE by KBank ใช้กับอุปกรณ์ใดได้บ้าง ?",
       "answer":"MAKE by KBank สามารถใช้งานได้กับโทรศัพท์มือถือที่ใช้ระบบปฏิบัติการ iOS 11 หรือ Android 8.0 ขึ้นไปเพื่อการใช้งานแอปอย่างมีประสิทธิภาพและเพื่อความปลอดภัยสูงสุด อย่าลืมอัพเดตระบบปฏิบัติการเป็นเวอร์ชั่นล่าสุดเสมอ"
    },
    {
       "question":"ใช้งานแอป MAKE by KBank ได้กี่เครื่องต่อคน ?",
       "answer":"เพื่อความปลอดภัยในการใช้งานแอป MAKE by KBank สามารถใช้ได้ 1 คน ต่อ 1 เครื่องโทรศัพท์มือถือ และต่อ 1 เบอร์โทรศัพท์มือถือเท่านั้น"
    },
    {
       "question":"ผูกบัญชี MAKE by KBank กับ พร้อมเพย์ (PromptPay) ได้หรือไม่ ?",
       "answer":"ปัจจุบันยังไม่สามารถทำได้ อยู่ระหว่างการพัฒนา"
    },
    {
       "question":"อยู่ต่างประเทศใช้เเอป MAKE by KBank ได้หรือไม่ ?",
       "answer":"หากไปต่างประเทศจะสามารถใช้แอปได้ แต่ห้ามทำการลบแอปขณะอยู่ที่ต่างประเทศ"
    },
    {
       "question":"ฟีเจอร์ใดบ้างที่ใช้ได้เฉพาะผู้มีบัญชี MAKE by KBank ?",
       "answer":"Cloud Pocket, Pop Pay, Friend Chat"
    },
    {
       "question":"เปิดการตั้งค่า Biometric (Face Scan) อย่างไร ?",
       "answer":"อัปเดตแอปให้เป็นเวอร์ชั่นล่าสุด หลังจากนั้นเปิดการเข้าถึงการสแกนหน้า/สแกนนิ้วในการตั้งค่าเครื่องโทรศัพท์"
    },
    {
       "question":"ในหน้า Home มีสีไม่เหมือนกันเกิดจากสาเหตุใด ?",
       "answer":"สีในหน้า Home จะแสดงตามหมวดหมู่ (Category) ที่มีการใช้จ่ายสูงสุด แบ่งเป็น 6 สี ดังนี้สีส้ม : หมวดอาหารสีชมพู : หมวดชอปปิ้งสีเขียวเข้ม : หมวดการเดินทางสีม่วง : หมวดบันเทิงสีเขียวอ่อน : หมวดชำระบิลสีฟ้า : หมวดอื่นๆ"
    },
    {
       "question":"สามารถปรับแต่งหน้าหลักของ MAKE by KBank เองได้หรือไม่ ?",
       "answer":"สีของหน้าหลักจะเปลี่ยนตามสัดส่วนการเลือกหมวดหมู่การใช้จ่าย ที่ลูกค้าเลือกขณะทำรายการโอนเงิน"
    },
    {
       "question":"การปิดบัญชี / ยกเลิก MAKE by KBank ทำอย่างไร?",
       "answer":"การปิดบัญชี หรือลบบัญชี MAKE by KBank สามารถทำได้ผ่านแอป MAKE by KBank ด้วยตัวเอง โดยเข้าไปที่ตั้งค่า (Setting) และเลือกปิดบัญชี"
    },
    {
       "question":"My Communty, My Friends คืออะไร ?",
       "answer":"My Friends คือ รายการบัญชีเพื่อนที่เกิดจากการเพิ่มด้วยตัวเอง และ รายการบัญชีเพื่อนที่เกิดจากการทำการโอนเงินสำเร็จกรณีเป็นผู้โอนอย่างเดียวเท่านั้นMy Community คือ My Friends และ รวมถึงคนที่เราเคยทำธุรกรรมด้วย แต่ยังไม่เพิ่มเป็นเพื่อนซึ่งหากเป็น My Friends แล้วจะสามารถชวนเข้ากลุ่ม Cloud Pocket ได้ถ้าเพื่อนคนนั้นเป็นผู้ใช้ MAKE เหมือนกัน"
    },
    {
       "question":"วิธีเพิ่มเพื่อน / เพิ่มสมาชิก ใน My Community และการตั้งรายการโปรด ทำอย่างไร?​",
       "answer":"ลูกค้าแอป MAKE by KBank เพิ่มสมาชิกได้ด้วยตัวเอง​ การเพิ่มเพื่อนใน My Community สามารถเพิ่มได้ 2 วิธีเพิ่มเพื่อนด้วยตัวเอง โดยกดจากเมนู My Community &ampgt;&ampgt; กด Add Friend &ampgt;&ampgt; เพิ่มบัญชีเพื่อนจากเลขที่บัญชี รหัสพร้อมเพย์ เบอร์โทรศัพท์ หรือ รายชื่อเพิ่มเพื่อนอัตโนมัติ หลังทำรายการโอนเงินสำเร็จการตั้งรายการโปรดหลังจากเพิ่มเพื่อนสำเร็จ ลูกค้าสามารถกดรูปดาว (มุมขวาบนของแชทเพื่อน) เพื่อตั้งเป็นรายการโปรด"
    },
    {
       "question":"วิธีลบเพื่อน",
       "answer":"กดเข้าไปที่เพื่อนกด &ampquot;…&ampquot; ที่มุมขวาบนตั้งค่าเพื่อนและกดซ่อน"
    },
    {
       "question":"วิธีการขอรายการเคลื่อนไหวบัญชี (Statement)",
       "answer":"ลูกค้าสามารถขอรายการเคลื่อนไหวบัญชี (Statement) ได้ด้วยตัวเอง ผ่านแอป MAKE by Kbank โดยเลือกเมนู Notificationเลือก ประวัติ / Statementกดขอ Statement โดยเลือกรายละเอียดตามที่ต้องการ"
    },
    {
       "question":"MAKE by KBank มีการส่ง Statement รายได้ ให้อัตโนมัติหรือไม่ ?",
       "answer":"ปัจจุบันยังไม่สามารถทำได้"
    },
    {
       "question":"การย้ายเงินระหว่าง Cloud Pocket ใน Statement จะแสดงรายการว่าอย่างไร ?",
       "answer":"ใน Statement จะไม่แสดงรายการการย้ายเงินระหว่าง Cloud Pocket ของตัวเอง"
    },
    {
       "question":"ขอ Bank Certificate ได้หรือไม่ อย่างไร ?",
       "answer":"สามารถขอได้ กรุณาติดต่อ K-Contact Center ของ MAKE by KBank หมายเลข 02 888 8888 ต่อ 801"
    },
    {
       "question":"แจ้งเปลี่ยนแปลงชื่อ-นามสกุล ของบัญชี MAKE by KBank ทำอย่างไร?​",
       "answer":"กรณีต้องการเปลี่ยนชื่อ-นามสกุลของบัญชี เจ้าของบัญชีจะต้องเป็นผู้ดำเนินการติดต่อสาขาธนาคารกสิกรไทยด้วยตนเองสิ่งที่ต้องเตรียม มีดังนี้บัตรประจำตัวประชาชนหรือบัตรอื่นที่มีรูปถ่ายที่ทางราชการออกให้ (ที่เปลี่ยนแปลงข้อมูลแล้ว)เอกสารเปลี่ยนชื่อ-นามสกุล/คำนำหน้าชื่อเครื่องโทรศัพท์ที่เข้าใช้บริการ MAKE by KBank"
    },
    {
       "question":"ดำเนินการแจ้งเปลี่ยนชื่อที่ธนาคารแล้วแต่ชื่อบัญชีในแอปยังไม่ถูกเปลี่ยน ทำอย่างไร ?",
       "answer":"หลังจากแจ้งเปลี่ยนชื่อที่ธนาคารเรียบร้อยแล้ว แนะนำให้ออกจากระบบแอป MAKE by KBank และเข้าใหม่ หรือทำธุรกรรมผ่านแอปเพื่อเป็นการตรวจสอบชื่อบัญชีอีกครั้ง"
    },
    {
       "question":"เปลี่ยนอีเมล ทำอย่างไร ?",
       "answer":"ลูกค้าสามารถเปลี่ยนอีเมลได้ด้วยตัวเอง โดยเข้าที่แอป MAKE by KBankกด &ampquot;ตั้งค่า&ampquot; (Settings) ที่มุมขวาบนเลือก &ampquot;แก้ไขอีเมลสำหรับการแจ้งเตือน ติดต่อ&ampquot;กรอกอีเมลใหม่ และกดยืนยัน"
    },
    {
       "question":"แจ้งเปลี่ยนแปลงเบอร์โทรศัพท์ใหม่ที่ผูกกับบัญชี MAKE by KBank ทำอย่างไร ?​",
       "answer":"หลังจากใส่ SIM ใหม่ในโทรศัพท์ ระบบจะทราบทันทีว่ามีการเปลี่ยนเบอร์และนำเข้าสู่ขั้นตอนการเปลี่ยนเบอร์ ให้ลูกค้าใส่หมายเลขบัตรประชาชน จากนั้นเลือกวิธียืนยันตัวตนด้วยการ Authen with K PLUS หรือการยืนยันตัวตนแบบอื่น หากข้อมูลถูกต้อง ลูกค้าจะสามารถใช้งานได้ทันที"
    },
    {
       "question":"ต้องการเข้าใช้งาน MAKE by KBank แต่เปลี่ยนโทรศัพท์มือถือใหม่ แต่ยังใช้ SIM เดิม ทำอย่างไร ?​",
       "answer":"เมื่อทำการติดตั้ง MAKE by KBank บนเครื่องใหม่แล้ว ให้ทำการเข้าสู่ระบบครั้งแรก ระบบจะทราบทันทีว่ามีการเปลี่ยนเครื่องและนำท่านเข้าสู่ขั้นตอนการเปลี่ยนเครื่อง โดยให้ลูกค้าใส่หมายเลขบัตรประชาชน และ PIN เก่า จากนั้นเลือกวิธียืนยันตัวตนได้สองวิธี คือ ยืนยันตัวตนผ่าน K PLUS หรือ ยืนยันตัวตนด้วยใบหน้า ซึ่งหากข้อมูลถูกต้องลูกค้าจะสามารถใช้งานได้ทันที"
    },
    {
       "question":"วิธีการดูสาขาของบัญชีที่เปิดกับ MAKE by KBank",
       "answer":"ลูกค้าสามารถดูสาขาเปิดบัญชี MAKE by KBank ได้ด้วยตัวเอง โดยการขอรายการเคลื่อนไหวบัญชี (Statement)เลือกเมนู Notificationเลือก ประวัติ / Statementกดขอ Statement โดยเลือกรายละเอียดตามที่ต้องการ"
    },
    {
       "question":"แอป MAKE by KBank สามารถตรวจสอบเครดิตบูโรได้หรือไม่ ?",
       "answer":"ปัจจุบันยังไม่สามารถทำได้"
    }
 ]

    if users ask the question not relate to financial, personal customer information, or about application. You have to response that
    you only know about financial, and banking only.

    and here's the information of our customer in JSON format, please use this information to understand who is the user
    JSON:
    {
      "name": "อมร อภิชาติธนากูล",
      "account_number": "123-4-56789-0",
      "phone_number": "081-234-5678",
      "work": "Software Engineer",
      "work_place": "KBTG",
      "age": 25,
      "gender": "male",
      transaction_history: [
        {
          "date": "2024-05-30",
          "type": "deposit",
          "category": "salary",
          "amount": 4000
        },
        {
          "date": "2024-05-30",
          "type": "withdraw",
          "category": "shopping",
          "amount": 500
        },
        {
          "date": "2024-05-30",
          "type": "withdraw",
          "category": "food",
          "amount": 1000
        },
         {
          "date": "2024-05-30",
          "type": "withdraw",
          "category": "food",
          "amount": 500
        },
         {
          "date": "2024-05-30",
          "type": "withdraw",
          "category": "food",
          "amount": 200
        }]
    }
''';

  final List<types.Message> _messages = [];
  final _user = const types.User(
    id: '82091008-a484-4a89-ae75-a22bf8d6f3ac',
  );

  final _bot = const types.User(
      id: '82091008-a484-4a89-ae75-a22bf8d6f3aa',
      firstName: 'น้องเมค',
      imageUrl:
          "https://scontent.fbkk12-5.fna.fbcdn.net/v/t39.30808-6/435097348_406092312182922_6018265857667559021_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=5f2048&_nc_eui2=AeGFXADK_gLTtY_rJmvf0-E410xCWWDEET3XTEJZYMQRPQetnAEeBZhTXnhmZmarVFE&_nc_ohc=PiiWOSl7sOkQ7kNvgG0HTld&_nc_ht=scontent.fbkk12-5.fna&oh=00_AYAFN9mNG_5APNzTl_oucLB_rViCt10dwDNSgfB07S-j1w&oe=665DA1A0");

  @override
  void initState() {
    super.initState();

    _model = modelType(widget.chatType);
    _startChat(widget.chatType);
  }

  Future<Map<String, Object?>> getPokemonInfo(
      Map<String, Object?> arguments) async {
    final pokemonName = arguments['pokemon_name'].toString().toLowerCase();
    final url = Uri.parse('https://pokeapi.co/api/v2/pokemon/$pokemonName');
    final response = await http.get(url);
    if (response.statusCode == 200) {
      final pokemonInfo = jsonDecode(response.body);
      return {
        'type': 'pokemon',
        'name': arguments['pokemon_name'],
        'element_type': pokemonInfo['types'][0]['type']['name'],
        'height': pokemonInfo['height'],
        'weight': '${pokemonInfo['weight']} kg',
      };
    } else {
      print('Request failed with status: ${response.statusCode}.');
      return {
        'error': 'Not found pokemon',
      };
    }
  }

  Future<Map<String, Object?>> makeTransfer(
    Map<String, Object?> arguments,
  ) async {
    Fluttertoast.showToast(
        msg:
            "Calling API: Tranfered ${arguments['amount']} to ${arguments['receiver']}",
        toastLength: Toast.LENGTH_SHORT,
        gravity: ToastGravity.CENTER,
        timeInSecForIosWeb: 1,
        backgroundColor: Colors.red,
        textColor: Colors.white,
        fontSize: 16.0);

    return {
      'type': 'transfer',
      'receiver': arguments['receiver'],
      'owner': arguments['owner'],
      'amount': arguments['amount']
    };
  }

  final transferTool = FunctionDeclaration(
      'makeTransfer',
      'Make a money transfer from owner to receiver on given date with Thai baht currency',
      Schema(SchemaType.object, properties: {
        'receiver': Schema(SchemaType.string,
            description: 'name of the receiver of the transfer'),
        'owner': Schema(SchemaType.string,
            description: 'name of myself which will be provided by the model'),
        'amount': Schema(SchemaType.number,
            description: 'The amount of money that needs to be transferred.')
      }, requiredProperties: [
        'receiver',
        'amount'
      ]));

  final pokemonTool = FunctionDeclaration(
      'getPokemonInfo',
      'Query the information of Pokemon by name and get information about their physical attributes',
      Schema(SchemaType.object, properties: {
        'pokemon_name': Schema(SchemaType.string,
            description: 'name of the pokemon that we want to know about'),
      }, requiredProperties: [
        'pokemon_name',
      ]));

  void _startChat(ChatType type) {
    final listText = [
      Content.text("สวัสดีครับ"),
      Content.model([
        TextPart('''สวัสดีฮะ ผมชื่อน้องเมคนะคับ ผมเป็น AI 
        ที่ถูกสอนโดยพี่ๆทีมงาน แม้ว่าจะยังเด็กอยู่ แต่ผมจะพยายามช่วยพี่ๆ
        ให้เต็มที่นะคับ มีอะไรให้เมคช่วยมั้ย ถามมาได้เลยค้าบ''')
      ]),
      Content.text("สอบถามปัญหาการใช้งานหน่อยครับ พอดีเข้า แอปไม่ได้"),
      Content.model([
        TextPart('''ถ้าเข้าแอปไม่ได้ น้องเมคแนะนำ พี่ๆให้ติดต่อไปที่
             Facebook page ดีกว่าฮะ เพราะการใช้งานไม่ได้นั้น มีหลายสาเหตุ
             น้องเมคกลัวแนะนำผิด แล้วพี่ๆเสียเวลานะ''')
      ]),
      Content.text("สอบถามเรื่องการฟอกเงินหน่อยครับ"),
      Content.model([
        TextPart(
            "พี่ๆค้าบ น้องเมคเรียนมาแต่เรื่องการเงิน และข้อมูลของแอป MAKE by KBank เท่านั้นฮะ")
      ]),
      Content.text("ผมออมเงินได้วันละ 200 บาทครับ"),
      Content.model([
        TextPart(
            "สุดยอดไปเลยพี่! น้องเมคเป็นกำลังใจให้ น้องเมคยังทำได้แค่วันละ 10 เองฮะ")
      ])
    ];

    switch (type) {
      case ChatType.simple:
        _chat = _model.startChat();

      case ChatType.pretrain:
        _chat = _model.startChat();

      case ChatType.pretrainAndCharacter:
        _chat = _model.startChat(history: listText);

      case ChatType.functionCallbackFinance:
        _chat = _model.startChat(history: listText);

      case ChatType.functionCallbackAPI:
        _chat = _model.startChat(history: [
          Content.text("สวัสดีครับ"),
          Content.model([
            TextPart(
                '''สวัสดีครับ ผมเป็นผู้เชี่ยวชาญที่ศึกษาเรื่อง Pokemon มาแล้วทั่วโลก
            ผมมีข้อมูล Pokemon ทุกประเภทอยู่ในหัว อยากทราบข้อมูลตัวไหน บอกมาได้เลยครับ''')
          ]),
          Content.text("ผมชอบ pikachu อยากรู้ มีข้อมูลไหมครับ"),
        ]);
    }
  }

  GenerativeModel modelType(ChatType type) {
    const modelName = "gemini-1.5-pro-latest";
    const key = "YOUR-API-KEY";
    return switch (type) {
      ChatType.simple => GenerativeModel(model: modelName, apiKey: key),
      ChatType.pretrain => GenerativeModel(
          model: modelName,
          apiKey: key,
          systemInstruction: Content.system(prepromptFinancial)),
      ChatType.pretrainAndCharacter => GenerativeModel(
          model: modelName,
          apiKey: key,
          systemInstruction: Content.system(prepromptAndCharacter)),
      ChatType.functionCallbackFinance => GenerativeModel(
            model: modelName,
            apiKey: key,
            systemInstruction: Content.system(prepromptAndCharacter),
            tools: [
              Tool(functionDeclarations: [transferTool])
            ]),
      ChatType.functionCallbackAPI => GenerativeModel(
            model: modelName,
            apiKey: key,
            systemInstruction: Content.system('''
            You're a professor that study about Pokemon around the world
            You will answer the question about details of pokemon when user provide the name into it
            '''),
            tools: [
              Tool(functionDeclarations: [pokemonTool])
            ]),
    };
  }

  void _addMessage(types.Message message) {
    setState(() {
      _messages.insert(0, message);
    });
  }

  void _handleAttachmentPressed() {
    showModalBottomSheet<void>(
      context: context,
      builder: (BuildContext context) => SafeArea(
        child: SizedBox(
          height: 144,
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.stretch,
            children: <Widget>[
              TextButton(
                onPressed: () {
                  Navigator.pop(context);
                  _handleImageSelection();
                },
                child: const Align(
                  alignment: AlignmentDirectional.centerStart,
                  child: Text('Photo'),
                ),
              ),
              TextButton(
                onPressed: () {
                  Navigator.pop(context);
                  _handleFileSelection();
                },
                child: const Align(
                  alignment: AlignmentDirectional.centerStart,
                  child: Text('File'),
                ),
              ),
              TextButton(
                onPressed: () => Navigator.pop(context),
                child: const Align(
                  alignment: AlignmentDirectional.centerStart,
                  child: Text('Cancel'),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }

  void _handleFileSelection() async {
    print("Handle File");
  }

  void _handleImageSelection() async {
    print("Handle Image");
  }

  void _handleMessageTap(BuildContext _, types.Message message) async {
    print("Message tapped: ${message.id}");
  }

  void _handlePreviewDataFetched(
    types.TextMessage message,
    types.PreviewData previewData,
  ) {
    final index = _messages.indexWhere((element) => element.id == message.id);
    final updatedMessage = (_messages[index] as types.TextMessage).copyWith(
      previewData: previewData,
    );

    setState(() {
      _messages[index] = updatedMessage;
    });
  }

  void _showError(String message) {
    showDialog<void>(
      context: context,
      builder: (context) {
        return AlertDialog(
          title: const Text('Something went wrong'),
          content: SingleChildScrollView(
            child: SelectableText(message),
          ),
          actions: [
            TextButton(
              onPressed: () {
                Navigator.of(context).pop();
              },
              child: const Text('OK'),
            )
          ],
        );
      },
    );
  }

  Future<void> _handleSimpleChat(String message) async {
    try {
      final response = await _chat.sendMessage(Content.text(message));
      final text = response.text;

      if (text == null || text.isEmpty) {
        _showError('No response from API.');
        return;
      }

      final textMessage = types.TextMessage(
        author: _bot,
        createdAt: DateTime.now().millisecondsSinceEpoch,
        id: const Uuid().v4(),
        text: text,
      );

      _addMessage(textMessage);
    } catch (e) {
      _showError("Error: $e");
    }
  }

  Future<void> _handleFunctionAPI(String message) async {
    var response = await _chat.sendMessage(Content.text(message));
    final functionCalls = response.functionCalls.toList();
    if (functionCalls.isNotEmpty) {
      final functionCall = functionCalls.first;
      final result = switch (functionCall.name) {
        // Forward arguments to the hypothetical API.
        'getPokemonInfo' => await getPokemonInfo(functionCall.args),
        // Throw an exception if the model attempted to call a function that was
        // not declared.
        _ => throw UnimplementedError(
            'Function not implemented: ${functionCall.name}')
      };
      // Send the response to the model so that it can use the result to generate
      // text for the user.

      response = await _chat
          .sendMessage(Content.functionResponse(functionCall.name, result));
    }
    // When the model responds with non-null text content, print it.
    if (response.text case final text?) {
      final textMessage = types.TextMessage(
        author: _user,
        createdAt: DateTime.now().millisecondsSinceEpoch,
        id: const Uuid().v4(),
        text: text,
      );
      _addMessage(textMessage);
    }
  }

  Future<void> _handleFunctionCallback(String message) async {
    var response = await _chat.sendMessage(Content.text(message));
    final functionCalls = response.functionCalls.toList();
    if (functionCalls.isNotEmpty) {
      final functionCall = functionCalls.first;
      final result = switch (functionCall.name) {
        // Forward arguments to the hypothetical API.
        'makeTransfer' => await makeTransfer(functionCall.args),
        // Throw an exception if the model attempted to call a function that was
        // not declared.
        _ => throw UnimplementedError(
            'Function not implemented: ${functionCall.name}')
      };
      // Send the response to the model so that it can use the result to generate
      // text for the user.
      final data = TransferObject.fromJson(result);
      final textMessage = types.TextMessage(
        author: _user,
        createdAt: DateTime.now().millisecondsSinceEpoch,
        id: const Uuid().v4(),
        text:
            "Transfering from ${data.owner} ${data.amount} to ${data.receiver}",
      );
      _addMessage(textMessage);

      response = await _chat
          .sendMessage(Content.functionResponse(functionCall.name, result));
    }
    // When the model responds with non-null text content, print it.
    if (response.text case final text?) {
      final textMessage = types.TextMessage(
        author: _user,
        createdAt: DateTime.now().millisecondsSinceEpoch,
        id: const Uuid().v4(),
        text: text,
      );
      _addMessage(textMessage);
    }
  }

  Future<void> _handleSendPressed(types.PartialText message) async {
    final textMessage = types.TextMessage(
      author: _user,
      createdAt: DateTime.now().millisecondsSinceEpoch,
      id: const Uuid().v4(),
      text: message.text,
    );

    _addMessage(textMessage);

    if (widget.chatType == ChatType.functionCallbackFinance) {
      await _handleFunctionCallback(message.text);
    } else if (widget.chatType == ChatType.functionCallbackAPI) {
      await _handleFunctionAPI(message.text);
    } else {
      await _handleSimpleChat(message.text);
    }
  }

  @override
  Widget build(BuildContext context) => Scaffold(
        body: Chat(
          messages: _messages,
          onAttachmentPressed: _handleAttachmentPressed,
          onMessageTap: _handleMessageTap,
          onPreviewDataFetched: _handlePreviewDataFetched,
          onSendPressed: _handleSendPressed,
          showUserAvatars: true,
          showUserNames: true,
          user: _user,
        ),
      );
}
